Attribute VB_Name = "@SystemUpdaterList"
'****************************  start of program ********************************
'==============================================================================*
'
'        SYSTEM_NAME     : 加瀬総合システム
'        SUB_SYSTEM_NAME : レンタル管理システム
'
'        PROGRAM_NAME    :
'        PROGRAM_ID      : SystemUpdateList
'        PROGRAM_KBN     :
'
'        CREATE          :
'        CERATER         :
'        Ver             : 0.0
'
'        UPDATE          : 2008/05/14
'        UPDATER         : N.Miura
'        Rev             : 0.0
'                        : SystemUpdateListの作成
'
'        UPDATE          : 2008/05/23
'        UPDATER         : tajima
'        Rev             : 0.1
'                        : GenYardPage(ヤードページ生成)       V0.0=>V0.1
'                        : FKS441(ヤードページ生成UP)          V0.0=>V0.1
'                        : FVS600(契約入力)                    V1.8=>V1.9
'                        : FVS601(契約入力)                    V1.8=>V1.9
'
'        UPDATE          : 2008/06/06
'        UPDATER         : tajima
'        Rev             : 0.2
'                        : FKS440(ヤードマスタメンテ)          V1.9=>V1.a
'
'        UPDATE          : 2008/06/10
'        UPDATER         : tajima
'        Rev             : 0.3
'                        : FVS400(受付入力)                    V1.8=>V1.9
'
'        UPDATE          : 2008/06/27
'        UPDATER         : tajima
'        Rev             : 0.4
'                        : FKS00M(マスタ保守メニュー)          V0.4=>V0.5
'                        : FKS800(ﾎﾞｯｸｽﾏｽﾀﾒﾝﾃ)                 V0.0
'                        : FKS800_S01(ﾎﾞｯｸｽﾏｽﾀﾒﾝﾃサブ）        V0.0
'                        : FKS810(ﾎﾞｯｸｽﾏｽﾀﾒﾝﾃ詳細)             V0.0
'                        : FKS810_S01(ﾎﾞｯｸｽﾏｽﾀﾒﾝﾃ詳細サブ)     V0.0
'                        : FKS820(ヤードボックス情報リスト)    V0.0
'
'        UPDATE          : 2008/08/01
'        UPDATER         : N.MIURA
'        Rev             : 0.5
'                        : 1.MSZZ002(DB_汎用関数)          V0.5=>V0.6
'                          2.MSHS012(テーブルリンク(KOMS)) V0.2=>V0.3
'                          3.以下引数変更　ＤＢ名＝＞部門コード
'                            MSHS012_KONT(外部リンク一括切替マクロ"コンテナ") V0.0=>V0.1
'                            MSHS012_OFFI(外部リンク一括切替マクロ"オフィス") V0.0=>V0.1
'                            MSHS012_TORA(外部リンク一括切替マクロ"トランク") V0.0=>V0.1
'                            MSHS012_YOKO(外部リンク一括切替マクロ"横浜鋼管") V0.0=>V0.1
'                          4.以下削除
'                            MSHS012_KANB(外部リンク一括切替マクロ"看板")
'                            MSHS011_KASE(外部リンク一括切替マクロ"加瀬")
'                          5.MSHS011     (テーブルリンク(KAGTOS)の削除
'                          6.MSHS013     (KASE_DBテーブルリンク(KOMS.MDB)     V0.0
'                          7.MSHS013_KASE(外部リンク一括切替マクロ"KASE_DB")  V0.0
'                          7.LF0003      (コンテナ分析表（使用基準）)         V0.5=V0.6
'
'        UPDATE          : 2008/08/10
'        UPDATER         : S.SHIBAZAKI
'        Rev             : 0.0
'                        : 全テーブル再リンク（データベースサーバー切り替え対応）
'
'        UPDATE          : 2008/08/18
'        UPDATER         : S.SHIBAZAKI
'        Rev             : 0.0
'                        : FVS500(予約入力)         V2.1=>V2.2
'
'        UPDATE          : 2008/09/25
'        UPDATER         : S.SHIBAZAKI
'        Rev             : 0.0
'                        : FVS400(受付入力)                         V1.9=>V2.0
'                        : FVS600(契約入力)                         V1.9=>V2.0
'                        : FVS601(契約入力)                         V1.9=>V2.0
'                        : MSZZ039(共通関数 統合ヘルパー出力)       V0.4=>V0.5
'
'        UPDATE          : 2008/09/26
'        UPDATER         : S.SHIBAZAKI
'        Rev             : 0.0
'                        : FVS400(受付入力)                         V2.0=>V2.1
'
'
'        UPDATE          : 2008/10/06
'        UPDATER         : hirano
'        Rev             : 0.5
'                        : GenYardPage                         V0.0=>V0.1
'
'        UPDATE          : 2008/10/30
'        UPDATER         : hirano
'        Rev             : 0.5
'                        : FKS441                               V0.1=>V0.2
'
'        UPDATE          : 2008/11/17
'        UPDATER         : S.SHIBAZAKI
'        Rev             : 0.0
'                        : FVS400(受付入力)                         V2.1=>V2.3
'                        : FVS600(契約入力)                         V2.0=>V2.1
'                        : FVS601(契約入力)                         V2.0=>V2.1
'                        : MSZZ039(共通関数 統合ヘルパー出力)       V0.5=>V0.6
'
'        UPDATE          : 2009/01/20
'        UPDATER         : N.MIURA
'        Rev             : 0.0
'                          FKS700 (2009/01/14 V0.2 割引マスタ一覧)            V0.1=>V0.2
'                          FKS710 (2009/01/14 V0.4 割引マスタメンテナンス)    V0.3=>V0.4
'                          MSZZ039(2009/01/16 V0.9 共通関数 統合ヘルパー出力) V0.8=>V0.9
'                          MSZZ045(2009/01/14 V0.3 共通関数 自動割引)         V0.2=>V0.3
'
'        UPDATE          : 2009/03/04
'        UPDATER         : N.MIURA
'        Rev             : 0.0
'                          ワークテーブル削除
'                          FKS310_dbo_CARG_FILE_MONTH  DEL
'                          FKS310_dbo_REQU_FILE_MONTH  DEL
'
'        UPDATE          : 2009/03/04
'        UPDATER         : N.MIURA
'        Rev             : 0.0
'                          1.不要レポート削除
'                            RKS240_請求明細書          DEL
'                            RKS260_ヤード別粗利表
'                            RKS260_ヤード別粗利表_SUB1
'                            RKS260_ヤード別粗利表_SUB1L
'                            RKS260_ヤード別粗利表_SUB1R
'                            RKS260_ヤード別粗利表_SUB2
'                            RKS260_ヤード別粗利表_SUB2L
'                            RKS260_ヤード別粗利表_SUB2R
'                            コンテナマスタ一覧表
'                            コントロールマスタ一覧表
'                            RKS360_スポット請求明細書
'                            RKS360_スポット請求明細書_SUB
'                          2.不要ワークテーブル削除
'                            FKS810_コンテナ予約ＷＫ
'                            FVS010_W01
'                            FVS010_W02
'                            FVS020_W01
'                            FVS020_W02
'                            FVS020_W03
'                            TKS050_請求データ修正ＷＫ
'                            TKS050_請求データ修正ＷＫＡ
'                            TKS310_請求データ生成ＷＫ
'                            TKS360_スポット請求明細書WK
'                            TKS360_スポット請求明細書WK2
'                            WK_LQ000_TEMP_2
'                            WK_LQ0000_TEMP_2
'                            顧客マスタＷＫ
'                            予約受付リストWK
'                            預り証ＷＫ
'                            領収証ＷＫ
'                           3.不要機能削除
'                             MFLZH20     V0.0 2003/04/21 価格表
'                             MRLZH20_M00
'                             WK_MQLZH20_TEMP
'                             MFLZH10     V0.2 2004/08/20 ｺﾝﾃﾅ価格設定
'                             MFLZH10S00  V0.0 2000/07/00 ｺﾝﾃﾅ価格設定
'                             WK_MQLZH10_TEMP
'                             FKS090(”仮”予約) V0.0 2004/11/11 解約入力
'                             FKS030_コンテナ詳細 V0.8 2005/02/18 契約詳細
'                             FKS041V0.5 2005/06/01 契約入力
'
'        UPDATE          : 2009/03/09
'        UPDATER         : N.MIURA
'        Rev             : 0.0
'                          FVS400 2009/03/09 V3.0 受付入力 V2.9=>V3.0
'
'        UPDATE          : 2009/04/24
'        UPDATER         : N.MIURA
'        Rev             : 0.0
'                          FVS400 2009/04/23 V3.3 受付入力  V3.2=>V3.3
'
'        UPDATE          : 2009/04/24
'        UPDATER         : N.MIURA
'        Rev             : 0.1
'                          FVS400 2009/04/23 V3.3 受付入力  V3.2=>V3.3
'                          保証区分、保証会社コードコンボの再保存
'
'        UPDATE          : 2009/05/14
'        UPDATER         : N.MIURA
'        Rev             : 0.1
'                          LF0050 2009/05/14 V1.5 契約データ出力 V1.3=>V1.5
'
'        UPDATE          : 2009/06/13
'        UPDATER         : N.MIURA
'        Rev             : 0.0
'                          FKS020 2009/06/13 V1.6 利用状況   V1.5 => V1.6
'                          FVS021 2009/06/13 V0.d 空状況詳細 V0.C => V0.d
'
'        UPDATE          : 2009/06/19
'        UPDATER         : N.MIURA
'        Rev             : 0.0
'                          FKS000 2008/07/02 V4.6 メインメニュー V4.6 => V5.0
'
'        UPDATE          : 2009/06/23
'        UPDATER         : N.MIURA
'        Rev             : 0.0
'                          ワークテーブル削除
'                          01.FKS340_月次損益集計ＷＫ
'                          02.TKS080_入出庫入力WK
'                          03.TKS100_地主台帳ＷＫ
'                          04.TKS110_地主契約更新一覧表ＷＫ
'                          05.TKS110_地主契約更新一覧表ＷＫ
'                          06.TKS250_コンテナ損益月次集計①ＷＫ
'                          07.TKS260_コンテナ損益表ＷＫ1
'                          08.TKS260_コンテナ損益表ＷＫ2
'                          09.TKS260_コンテナ損益表ＷＫ3
'                          10.TKS260_コンテナ損益表ＷＫ4
'                          11.TKS280_その他売上支払表WK
'                          12.TKS290_広告経費支払表WK
'                          13.TKS350_コンテナ粗利表ＷＫ
'                          14.TKS350_コンテナ粗利表ＷＫ
'                          15.TKS370_買い入れコンテナ在庫表WK
'                          16.TKS380_コンテナ損益月次集計②ＷＫ
'                          17.TKS380_コンテナ損益月次集計②ＷＫ2
'                          18.WK_LQ0049_TEMP
'                          19.取引先マスタＷＫ
'                          20.請求ファイルＷＫ
'                          21.地主マスタＷＫ
'                          22.名称マスタＷＫ
'                          23.名称マスタリストＷＫ
'                          クエリー削除
'                          01.FQS240_20051224
'                          02.LQ0004_M00
'                          03.LQ0009_M00 V0.0 2000/07/00 ｺﾝﾃﾅ
'                          04.LQ0038_M00 V0.0 2001/03/08 ｺﾝﾃﾅ部 新規契約売上ﾁｪｯｸﾘｽﾄ
'                          05.LQ0038_S00 V0.1 2001/03/08 ｺﾝﾃﾅ部 新規契約抽出
'                          06.LQ0038_S01 V0.0 2001/03/08 ｺﾝﾃﾅ部 新規契約売上抽出
'                          07.LQ0039_M00 V0.0 2001/03/08 ｺﾝﾃﾅ部 解約売上ﾁｪｯｸﾘｽﾄ
'                          08.LQ0039_S00 V0.1 2001/03/08 ｺﾝﾃﾅ部 解約契約抽出
'                          09.LQ0039_S01 V0.0 2001/03/08 ｺﾝﾃﾅ部 解約売上抽出
'                          10.LQ0040_M00 V0.0 2001/03/08 ｺﾝﾃﾅ部 既存契約売上ﾁｪｯｸﾘｽﾄ
'                          11.LQ0040_S00 V0.1 2001/03/08 ｺﾝﾃﾅ部 新規契約抽出
'                          12.LQ0040_S01 V0.0 2001/03/08 ｺﾝﾃﾅ部 新規契約売上抽出
'                          13.LQ0041_M00
'                          14.LQ0043_M00 V0.0 2001/05/08 ｺﾝﾃﾅ部 ｺﾝﾃﾅ契約一覧表
'                          15.LQ0049_M00
'                          16.QKS160_M00 V0.1 2004/11/22 解約一覧データ
'                          17.QKS160_M10 V0.0 2004/08/18 解約一覧データ（チェックリスト）
'                          フォーム削除
'                          01.FKS008 V3.1 2004/11/24 損益管理メニュー
'                          02.FKS009 2007/05/25 V3.3 分析帳票メニュー
'                          03.FKS00M 2008/12/01 V0.6 マスタ保守メニュー
'                          04.FKS00R 2007/01/26 V0.2 修繕メニュー
'                          05.FKS010_地主契約入力     V0.1 2004/11/06 地主契約入力
'                          06.FKS010_地主契約入力サブ V0.0 2003/05/06 地主契約入力サブ
'                          07.FKS051                V0.0 2001/08/07 売掛管理 売上登録
'                          08.FKS051S00             V0.0 2001/08/07 売掛管理 売上登録（サブ）
'                          09.FKS051S10             V0.0 2002/06/12 売掛管理 契約明細
'                          10.FKS070                V0.2 2004/11/24 経費入力
'                          11.FKS080_入出庫入力     V0.0 2004/12/08 入出庫入力
'                          12.FKS080_入出庫入力サブ V0.0 2004/12/08 入出庫入力（サブ）
'                          13.FKS100 V0.1 2004/11/24 地主台帳
'                          14.FKS110 V0.1 2004/11/24 地主契約更新一覧表
'                          15.FKS150 V0.1 2004/11/24 更新一覧表
'                          16.FKS160 V0.2 2004/11/22 解約一覧表
'                          17.FKS170 V0.1 2004/11/24 請求明細一覧表
'                          18.FKS190 V0.1 2004/11/24 預り保証金一覧表
'                          19.FKS250 V0.1 2004/11/24 損益月次集計(ヤード別)
'                          20.FKS260 V0.4 2004/11/24 損益表
'                          21.FKS280 V0.1 2004/11/24 その他売上支払表
'                          22.FKS290 V0.1 2004/11/24 広告経費支払表
'                          23.FKS340 V0.1 2004/11/24 月次損益集計
'                          24.FKS350 V0.1 2004/11/24 粗利集計表
'                          25.FKS370 2004/11/24 V0.3 買い入れコンテナ在庫表
'                          26.FKS380 2004/11/24 V0.1 コンテナ損益月次集計（種別）
'                          27.FKS390 V0.3 2004/11/24 払込データ作成
'                          28.FKS400 V0.3 2004/11/24 コントロールマスタ
'                          29.FKS410 V0.1 2004/11/24 名称マスタメンテ
'                          30.FKS410S00 V0.1 2004/11/24 名称マスタメンテ(サブ)
'                          31.FKS420 V0.1 2004/11/24 地主マスタ保守
'                          32.FKS460 V0.1 2004/11/24 名称マスタ一覧表
'                          33.FKS470 V0.1 2004/11/24 地主マスタリスト
'                          34.FKS500 V0.1 2004/11/24 取引先マスタ保守
'                          35.FKS510 V0.1 2004/11/24 取引先マスタ一覧表
'                          36.FVS602 2006/05/18 V1.0 契約入力(看板用)
'                          37.LF0004 V0.0 2004/03/02 設置一覧表
'                          38.LF0009 V0.1 2005/02/21 経費一覧表
'                          39.LF0016 V0.0 2000/07/00 ｺﾝﾃﾅ　宛名印刷(契約期間)
'                          40.LF0038 新規売上チェックリスト
'                          41.LF0041 V0.1 2004/12/08 契約日報リスト
'                          42.LF0043 顧客別契約一覧表
'                          43.LF0049 2005/06/13 V0.2 修繕データ出力
'                          レポート削除
'                          01.LR0004_M00                     V0.0 2004/03/02 コンテナ設置一覧表
'                          02.LR0009                         V0.0 2000/07/06 経費一覧表
'                          03.LR0038     新規契約売上チェックリスト
'                          04.LR0039     解約売上チェックリスト
'                          05.LR0040     既存契約売上チェックリスト
'                          06.LR0041                         V0.1 2005/02/21 契約日報リスト
'                          07.LR0043     契約一覧表
'                          08.RKS100_地主台帳                V0.1 2005/02/21
'                          09.RKS110_地主契約更新一覧表      V0.1 2005/02/21
'                          10.RKS150_更新一覧表              V0.1 2005/02/21
'                          12.RKS160_解約一覧表              V0.1 2005/02/21
'                          13.RKS170_請求明細一覧表USER      V0.1 2005/02/21
'                          14.RKS170_請求明細一覧表YARD      V0.1 2005/02/21
'                          15.RKS190_預り保証金一覧表_ヤード V0.1 2005/02/21
'                          16.RKS190_預り保証金一覧表_顧客   V0.1 2005/02/21
'                          17.RKS250_コンテナ損益月次集計①  V0.1 2005/02/21
'                          18.RKS250_ヤード別合計損益表      V0.1 2005/02/21
'                          19.RKS260_コンテナ損益表          V0.2 2005/02/21 n.miura
'                          20.RKS260_コンテナ損益表_OK       V0.1 2000/06/06 n.miura
'                          21.RKS260_コンテナ損益表_SUB1
'                          22.RKS260_コンテナ損益表_SUB1L
'                          23.RKS260_コンテナ損益表_SUB1R
'                          24.RKS260_コンテナ損益表_SUB2
'                          25.RKS260_コンテナ損益表_SUB2L
'                          26.RKS260_コンテナ損益表_SUB2R    V0.1 2000/06/24 OS kimura
'                          27.RKS280_その他売上支払表        V0.1 2005/02/21
'                          28.RKS290_広告経費支払表          V0.1 2005/02/21
'                          29.RKS350_コンテナ粗利表          V0.1 2005/02/21
'                          30.RKS370_買い入れコンテナ在庫表  V0.1 2005/02/21
'                          31.RKS380_コンテナ損益月次集計②  V0.1 2005/02/21
'                          32.RKS460_名称マスタ一覧表        V0.1 2005/02/21
'                          33.RKS470_地主マスタ一覧表        V0.1 2005/02/21
'                          34.RKS510_取引先マスタ一覧表      V0.1 2005/02/21
'                          モジュール
'                          01.modCvsSub2 2005/07/26 V0.6 払込データ作成
'                          テーブルリンク解除
'                          01.dbo_WK_ACPTNO_TEMP
'                          02.dbo_KYOU_TRAN
'                          03.dbo_JINU9_RFILE
'
'        UPDATE          : 2009/06/23
'        UPDATER         : N.MIURA
'        Rev             : 0.1
'                          MDB再作成
'
'        UPDATE          : 2009/06/23
'        UPDATER         : N.MIURA
'        Rev             : 0.2
'                          再登録
'                          07.FKS051                V0.0 2001/08/07 売掛管理 売上登録
'                          08.FKS051S00             V0.0 2001/08/07 売掛管理 売上登録（サブ）
'                          09.FKS051S10             V0.0 2002/06/12 売掛管理 契約明細
'
'        UPDATE          : 2009/06/29
'        UPDATER         : hirano
'        Rev             : 0.0
'                          FVS400                   v3.5
'                          MSZZ039                  v1.0
'
'        UPDATE          : 2009/07/17
'        UPDATER         : hirano
'        Rev             : 0.0
'                          FKS700                   v.0.3
'                          FKS700_S01               v.0.3
'                          FKS710                   v.0.5
'                          FKS720                   v.0.2
'                          MSZZ045                  v.0.6
'
'        UPDATE          : 2009/08/17
'        UPDATER         : hirano
'        Rev             : 0.0
'                          MSZZ045                  v.0.7
'
'        UPDATE          : 2009/09/10
'        UPDATER         : N.Miura
'        Rev             : 0.0
'                          1.LF0050     2009/09/08 V1.6 契約データ出力                           V1.5=>V1.6
'                          2.LQ0050_M00 2009/09/08 V1.4 契約データ（顧客住所無し&ヤード住所無し）V1.3=>V1.4
'                          3.LQ0050_M10 2009/09/08 V1.4 契約データ（顧客住所有り&ヤード住所無し）V1.3=>V1.4
'                          4.LQ0050_M20 2009/09/08 V1.2 契約データ（顧客住所無し&ヤード住所有り）V1.1=>V1.2
'                          5.LQ0050_M30 2009/09/08 V1.2 契約データ（顧客住所有り&ヤード住所有り）V1.1=>V1.2
'                          6.MSZZ012    V0.0 2004/07/31 共通関数 日付ﾁｪｯｸ                        V0.0
'
'
'        UPDATE          : 2009/09/12
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1.FVS400     2009/09/11 V3.6 受付入力                     V3.5=>V3.6
'
'        UPDATE          : 2009/10/02
'        UPDATER         : hirano
'        Rev             : 0.0
'                          1.FVS400     V3.6=>V3.7
'                          2.MSZZ039    V1.4=>v.1.5
'                          3.FKS820     V0.0=>v.0.1
'
'        UPDATE          : 2009/10/02
'        UPDATER         : hirano
'        Rev             : 0.0
'                          1.FKS820     V0.1=>v.0.2
'
'        UPDATE          : 2009/10/19
'        UPDATER         : N.Miura
'        Rev             : 0.0
'                          1.LF0050     2009/10/05 V1.7 契約データ出力                             V1.6=>V1.7
'                          2.LF0051     2009/10/05 V0.0 契約一覧                                   V0.0
'                          3.LF0051_S00 2009/10/05 V0.0 契約一覧一覧サブフォーム                   V0.0
'                          4.LQ0050_M00 2009/10/05 V1.5 契約データ（顧客住所無し&ヤード住所無し）  V1.4=>V1.5
'                          5.LQ0050_M10 2009/10/05 V1.5 契約データ（顧客住所有り&ヤード住所無し）  V1.4=>V1.5
'                          6.LQ0050_M20 2009/10/05 V1.3 契約データ（顧客住所無し&ヤード住所有り）  V1.2=>V1.3
'                          7.LQ0050_M30 2009/10/05 V1.3 契約データ（顧客住所有り&ヤード住所有り）  V1.2=>V1.3
'                          8.MSZZ029    2008/05/21 V0.1 共通関数 画面/Reportが開いているかチェック V0.1
'
'        UPDATE          : 2009/10/23
'        UPDATER         : kihara
'        Rev             : 0.0
'                          1.FVS100_A02_W01     V0.0
'                          2.FVS100_W01         V0.0
'                          3.FVS400             V3.7=>V3.8
'                          4.FVS100             V0.0
'                          5.FVS100_S01         V0.0
'                          6.FVS100_A02_Q01     V0.0
'                          7.FVS100_A04_Q01     V0.0
'                          8.FVS100_A04_Q02     V0.0
'                          9.MSZZ039            V1.5=>V1.6
'
'        UPDATE          : 2009/10/26
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1.FKS000             V5.0⇒V5.1
'
'        UPDATE          : 2009/11/04
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1.FVS100             V0.0=>V0.1
'
'        UPDATE          : 2009/11/05
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1.FVS100             V0.1=>V0.2
'                          2.FKS000             V5.1=>V5.2
'
'        UPDATE          : 2009/11/06
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1.FKS721             V0.2=>V0.3
'
'        UPDATE          : 2009/11/10
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1.FSV400             V3.8=>V3.9
'
'        UPDATE          : 2009/11/18
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1.FVS100             V0.2=>V0.3
'
'        UPDATE          : 2009/12/02
'        UPDATER         : M.Ryu
'        Rev             : 0.0
'                          1.                         V0.6=>V0.7
'                          2.FKS240                         V0.A=>V0.B
'                          3.FKS440_ヤードマスタ保守        V1.d=>V1.e
'
'        UPDATE          : 2009/12/08
'        UPDATER         : M.Ryu
'        Rev             : 0.0
'                          1. FVS400    (FORM)              V3.9=>V4.0
'                          2. FVS600    (FORM)              V2.2=>V2.3
'                          3. FVS490    (FORM)              V0.2=>V0.3
'                          4. FVS910    (FORM)              V0.3=>V0.4
'                          5. FVS140    (FORM)              V0.3=>V0.4
'                          6. Print230  (MOD)               V0.0=>V0.1
'                          7. Print481  (MOD)               V0.0=>V0.1
'                          8. RKS230    (REP)               V0.0=>V0.1
'                          9. RKS481    (REP)               V0.0=>V0.1
'                          10.RKS490_ヤードマスタ一覧表(REP)V0.1=>V0.2
'                          11.QKS490_M00        (QUE)       V0.0=>V0.1
'                          12.ヤードマスタＷＫ  (TBL)       V0.1=>V0.2
'                          13.RKS481_W01        (TBL)       V0.0=>V0.1
'
'        UPDATE          : 2009/12/18
'        UPDATER         : K.ISHIZAKA
'        Rev             : 0.0
'                          1. FVS011    (FORM)              V0.9=>V1.0
'                          2. FVS011_S01(FORM)              V0.9=>V1.0
'                          3. MSZZ020   (MOD)               V0.0=>V0.1
'
'        UPDATE          : 2010/01/09
'        UPDATER         : M.Ryu
'        Rev             : 0.0
'                          1. FVS400    (FORM)              V4.0=>V4.1
'                          2. MSZZ039   (MOD)               V1.6=>V1.7
'                          3. RVS760    (REP)               V0.5=>V0.6
'
'        UPDATE          : 2010/02/02
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1. FVS770    (FORM)              V0.4=>V0.5
'                          2. RVS770    (REP)               V0.3=>V0.4
'
'        UPDATE          : 2010/02/03
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1. FKS140    (FORM)              V0.4=>V0.5
'                          2. RKS231    (REP)               V0.0
'                          2. Print231  (MOD)               V0.0
'
'        UPDATE          : 2010/02/04
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1. FKS140    (FORM)              V0.5=>V0.6
'                          2. RKS231    (REP)               V0.0=>V0.1
'                          2. Print231  (MOD)               V0.0=>V0.1
'
'        UPDATE          : 2010/02/10
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1. FKS140    (FORM)              V0.5=>V0.6
'                          2. RKS231    (REP)               V0.0=>V0.2
'                          2. Print231  (MOD)               V0.0=>V0.1
'
'        UPDATE          : 2010/02/12
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1. LF0005   　 (FORM)            V1.7=>V1.8
'                          2. LQ0050_M00  (QUE)             V1.5=>V1.6
'                          2. LQ0050_M10  (QUE)             V1.5=>V1.6
'                          2. LQ0050_M20  (QUE)             V1.3=>V1.4
'                          2. LQ0050_M30  (QUE)             V1.3=>V1.4
'
'        UPDATE          : 2010/02/15
'        UPDATER         : M.Honda
'        Rev             : 0.0
'                          1. FKS500    (FORM)              V2.3=>V2.4
'
'
'        UPDATE          : 2010/02/20
'        UPDATER         : M.Ryu
'        Rev             : 0.0
'                          1. Print231  (MOD)               V0.2=>V0.3
'
'        UPDATE          : 2010/03/15
'        UPDATER         : M.Ryu
'        Rev             : 0.0
'                          1. FVS400    (FORM)              V4.1=>V4.2
'
'        UPDATE          : 2010/03/25
'        UPDATER         : M.Ryu
'        Rev             : 0.0
'                          1. MSZZ039   (MOD)               V1.7=>V1.8
'
'        UPDATE          : 2010/03/26
'        UPDATER         : M.Ryu
'        Rev             : 0.0
'                          1. MSZZ039   (MOD)               V1.8=>V1.9
'                          2. FVS400    (FORM)              V4.2=>V4.3
'
'        UPDATE          : 2010/03/29
'        UPDATER         : M.Ryu
'        Rev             : 0.0
'                          1. MSZZ039   (MOD)               V1.9=>V2.0
'
'        UPDATE          : 2010/04/05
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1. GenYardPage(MOD)              V0.3=>V0.4
'
'        UPDATE          : 2010/04/13
'        UPDATER         : K.ISHIZAKA
'        Rev             : 0.0
'                          1.CmKomsMod      2010/04/10 V1.1 CmKomsMod       V1.0=>V1.1
'                          2.FKS240         2010/04/10 V1.1 請求表          V0.B=>V1.1
'                          3.FVS400         2010/04/13 V4.6 受付入力        V4.3=>V4.6
'                          4.FVS600         2010/04/10 V2.4 契約入力        V2.3=>V2.4
'                          5.FVS601         2010/04/10 V2.4 契約入力        V2.2=>V2.4
'
'        UPDATE          : 2010/04/17
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.LF0050         2010/04/17 V1.9 契約データ出力  V1.8=>V1.9
'                          2.LQ0050_M00     2010/04/17 V1.7 契約データ      V1.6=>V1.7
'                          3.LQ0050_M10     2010/04/17 V1.7 契約データ      V1.6=>V1.7
'                          4.LQ0050_M20     2010/04/17 V1.7 契約データ      V1.4=>V1.5
'                          5.LQ0050_M30     2010/04/17 V1.7 契約データ      V1.4=>V1.5
'
'        UPDATE          : 2010/04/23
'        UPDATER         : S.SHIBAZAKI
'        Rev             : 0.0
'                          1.FKS430         2010/04/19 V1.0 顧客マスタ保守  V0.9=>V1.0
'                          2.FVS400         2010/04/20 V4.7 受付入力        V4.6=>V4.7
'
'        UPDATE          : 2010/05/10
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.FKS430         2010/05/10 V1.1 顧客マスタ保守  V1.0=>V1.1
'                          2.FVS400         2010/05/10 V4.8 受付入力        V4.7=>V4.8
'
'        UPDATE          : 2010/05/28
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FVS400         2010/05/28 V4.9 受付入力        V4.8=>V4.9
'
'        UPDATE          : 2010/05/31
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. MSZZ039 (MOD) 2010/05/31 V2.1 共通関数 統合ヘルパー出力 V2.0=>V2.1
'
'        UPDATE          : 2010/06/18
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. MSZZ039 (MOD) 2010/06/18 V2.2 共通関数 統合ヘルパー出力 V2.1=>V2.2
'
'        UPDATE          : 2010/06/22
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FVS400         2010/06/22 V5.0 受付入力        V4.9=>V5.0
'
'        UPDATE          : 2010/06/22
'        UPDATER         : M.RYU
'        Rev             : 0.1
'                          1.FVS021         2010/06/10 V1.0 空状況詳細              V0.d=>V1.0
'                          2.FVS901         2010/06/10 V0.3 ヤード修繕一覧画面      V0.2=>V0.3
'                          3.FVS902         2010/06/10 V0.3 顧客修繕一覧画面        V0.2=>V0.3
'                          4.FVS903         2010/06/10 V0.3 部屋修繕一覧画面        V0.2=>V0.3
'                          5.CmReprMod      2007/01/26 V0.2 CmReprMod               V0.1=>V0.2
'
'        UPDATE          : 2010/06/30
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. MSZZ039   (MOD)   2010/06/30 V2.3 共通関数 統合ヘルパー出力   V2.2=>V2.3
'
'        UPDATE          : 2010/07/03
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. Print231  (MOD)   2010/07/03 V0.4 一時使用契約変更承諾書出力  V0.3=>V0.4
'                          2. RKS231    (REP)   2010/07/03 V0.2 一時使用契約変更承諾書      V0.1=>V0.2
'
'        UPDATE          : 2010/08/24
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. LF0001    (FORM)  2010/08/24 V0.2 契約・解約一覧表            V0.1⇒V0.2
'
'        UPDATE          : 2010/09/02
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. MSZZ039   (MOD)   2010/09/02 V2.4 共通関数 統合ヘルパー出力   V2.3=>V2.4
'
'        UPDATE          : 2010/09/13
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. FVS901    (FORM)  2010/09/13 V0.4 ヤード修繕一覧画面          V0.3=>V0.4
'                          2. FVS902    (FORM)  2010/09/13 V0.4 顧客修繕一覧画面            V0.3=>V0.4
'                          3. FVS903    (FORM)  2010/09/13 V0.4 部屋修繕一覧画面            V0.3=>V0.4
'
'        UPDATE          : 2010/10/18
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          1.CmReprMod  (MOD)   2010/06/10 V0.3 CmReprMod                   V0.2=>V0.3
'
'        UPDATE          : 2010/12/13
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.RVS760             2010/12/13 V0.7 解約メンテナンス表          V0.6=>V0.7
'
'        UPDATE          : 2010/12/21
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.FVS400             2010/12/21 V5.1 受付入力                    V5.0=>V5.1
'                          1.CmKomsMod          2010/12/20 V1.2 CmKomsMod                   V1.1=>V1.2
'                          1.MSZZ039            2010/12/21 V2.5 共通関数 統合ヘルパー出力   V2.4=>V2.5
'                          1.FKS440_ヤードマスタ保守      2010/12/21 V1.e ヤードマスタメンテ   V1.d=>V1.e
'
'        UPDATE          : 2010/12/24
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.FVS901_W01         2010/12/24 V0.1 修繕一覧                    V0.0=>V0.1
'                          1.FVS901             2010/12/24 V0.4 ヤード修繕一覧画面          V0.3=>V0.4
'                          1.FVS901_S01         2010/12/24 V0.1 修繕一覧サブ                V0.0=>V0.1
'                          1.FVS902             2012/12/24 V0.4 顧客修繕一覧画面            V0.3=>V0.4
'                          1.FVS903             2010/09/13 V0.4 部屋修繕一覧画面            V0.3=>V0.4
'
'        UPDATE          : 2010/12/27
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.FVS400             2010/12/27 V5.2 受付入力                    V5.1=>V5.2
'
'        UPDATE          : 2011/01/13
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. FKS240            2010/01/12 V1.2 請求表                      V1.1⇒V1.2
'                          2. RKS240            2010/01/12 V0.8 請求書                      V0.7⇒V0.8
'
'        UPDATE          : 2011/02/03
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1. FKS440            2011/02/03 V1.f ヤードマスタメンテ          V1.e⇒V1.f
'
'        UPDATE          : 2011/02/16
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. RKS240              2011/02/16 V0.9 請求書                    V0.8=>V0.9
'                          2. FVS400              2011/01/29 V5.3 受付入力                  V5.2=>V5.3
'
'        UPDATE          : 2011/02/25
'        UPDATER         : S.SHIBAZAKI
'        Rev             : 0.0
'                          1. FVS400              2011/02/21 V5.4 受付入力                  V5.3=>V5.4
'                          2. FVS500              2011/02/21 V2.5 予約入力                  V2.5=>V2.5
'                          3. FTG011              2011/02/12 V0.0 統合空状況　メイン        V0.0
'                          4. FTG011_S01          2011/02/12 V0.0 統合空状況　空状況一覧    V0.0
'                          5. FTG011_S02          2011/02/12 V0.0 統合空状況　条件詳細      V0.0
'                          6. FTG011_S03          2011/02/12 V0.0 統合空状況　用途一覧      V0.0
'                          7. FTG021              2011/02/12 V0.0 統合空詳細　メイン        V0.0
'                          8. FTG021_S01          2011/02/12 V0.0 統合空詳細  上段一覧      V0.0
'                          9. FTG021_S02          2011/02/12 V0.0 統合空詳細  下段一覧      V0.0
'                         10. MSTGP01             2011/02/06 V0.0 統合ＤＢ  コンテナ統合ＤＢ更新    V0.0
'                         11. MSZZ020             2011/02/22 V0.2 共通関数　起動時マクロ用  V0.1=>V0.2
'                         12. MSZZ025             2010/06/12 V0.4 共通関数 ＡＤＯ関数       V0.1=>V0.4
'                         13. MSZZ039             2011/02/06 V2.6 共通関数 統合ヘルパー出力 V2.5=>V2.6
'                         14. MSZZ060             2011/02/12 V0.0 共通関数　用途別背景色設定        V0.0
'                         15. MSZZ061             2011/02/12 V0.0 共通関数　あいまい検索    V0.0
'                         16. MSZZ027             2007/03/19 V0.2 共通関数 コンボボックス制御   V0.2
'                         17. MSZZ033             2010/02/20 V0.4 共通関数 入力チェック    V0.4
'                         18. MSZZ054             2010/07/22 V0.0 共通関数　サブフォーム制御    V0.0
'                         19. MSZZ016             2007/02/14 V0.1 共通関数 Unicode文字種チェック    V0.1
'                         20. MSZZ043             2008/04/12 V0.0 共通関数 ANSIコードに変換できる文字列かチェック   V0.0
'
'        UPDATE          : 2011/02/28
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. FVS400              2011/02/28 V5.5 受付入力                  V5.4=>V5.5
'
'        UPDATE          : 2011/03/03
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. FKS140              2011/03/02 V0.7 契約一覧表                V0.6=>V0.7
'                          2. Print481            2011/03/02 V0.2 契約リスト                V0.1=>V0.2
'
'        UPDATE          : 2011/03/04
'        UPDATER         : S.SHIBAZAKI
'        Rev             : 0.0
'                          1. MSZZ039             2011/03/02 V2.7 共通関数 統合ヘルパー出力         V2.6=>V2.7
'                          2. MSTGP01             2011/03/02 V0.1 統合ＤＢ  コンテナ統合ＤＢ更新    V0.0=>V0.1
'
'        UPDATE          : 2011/03/09
'        UPDATER         : K.ISHIZAKA
'        Rev             : 0.0
'                          1. FTG011              2011/03/08 V0.1 統合空状況　メイン                V0.0=>V0.1
'                          2. FTG021              2011/03/08 V0.1 統合空詳細　メイン                V0.0=>V0.1
'                          3. MSTGP01             2011/03/08 V0.2 統合ＤＢ  コンテナ統合ＤＢ更新    V0.1=>V0.2
'
'        UPDATE          : 2011/03/12
'        UPDATER         : K.ISHIZAKA
'        Rev             : 0.0
'                          1. FVS300                    2011/03/14 V0.0 毎月回収方法進捗管理                  V0.0
'                          2. FVS300_S01                2011/03/14 V0.0 毎月回収方法進捗管理（一覧）          V0.0
'                          3. FVS300_S02                2011/03/14 V0.0 毎月回収方法進捗管理（検索条件）      V0.0
'                          4. FVS300_Q01                2011/03/10 V0.0 毎月回収方法進捗管理表                V0.0
'                          5. FVS910                    2011/03/10 V0.5 修繕入力ダイアログ              V0.4=>V0.5
'                          6. FKS000                    2011/03/10 V5.3 メインメニュー                  V5.2=>V5.3
'                          7. MSZZ021                   2006/08/14 V0.6 共通関数　メール送信            V0.5=>V0.6
'                          8. FKS440_ヤードマスタ保守   2011/03/05 V2.0 ヤードマスタメンテ              V1.f=>V2.0
'                          9. FKS440_ヤードマスタサブ上 2011/03/05 V2.0 ヤードマスタメンテ（サブ）上段  V0.8=>V2.0
'                         10. FKS440_ヤードマスタサブ下 2011/03/05 V2.0 ヤードマスタメンテ（サブ）下段  V0.7=>V2.0
'                         11. ヤード上ＷＫ              2011/03/05 V2.0 ヤードマスタメンテ（サブ）上段  V0.6=>V2.0
'                         12. ヤード下ＷＫ              2011/03/05 V2.0 ヤードマスタメンテ（サブ）下段  V0.6=>V2.0
'                         13. MSTGP01                   2011/03/12 V0.4 統合ＤＢ  コンテナ統合ＤＢ更新  V0.2=>V0.4
'                             ↓統合検索が起動されないようにバージョンダウン
'                         14. MSZZ020                   2009/12/07 V0.1 共通関数　起動時マクロ用        V0.2=>V0.1
'
'        UPDATE          : 2011/03/18
'        UPDATER         : S.SHIBAZAKI
'        Rev             : 0.0
'                          1. FTG011                    2011/03/16 V0.3 統合空状況　メイン              V0.2=>V0.3
'                          1. FTG011_S01                2011/03/10 V0.2 統合空状況　空状況一覧          V0.1=>V0.2
'                          1. FTG011_S02                2011/03/16 V0.3 統合空状況　条件詳細            V0.2=>V0.3
'                          1. FTG021                    2011/03/16 V0.3 統合空詳細　メイン              V0.2=>V0.3
'                          1. FTG021_S01                2011/03/10 V0.2 統合空詳細  上段一覧            V0.1=>V0.2
'                          1. FTG021_S02                2011/03/10 V0.2 統合空詳細  下段一覧            V0.1=>V0.2
'                          1. FVS400                    2011/03/14 V5.6 受付入力                        V5.5=>V5.6
'                          1. MSTGP01                   2011/03/15 V0.5 統合ＤＢ  コンテナ統合ＤＢ更新  V0.4=>V0.5
'                          1. MSZZ045                   2011/03/12 V0.8 共通関数 自動割引               V0.7=>V0.8
'                          1. MSZZ060                   2011/03/10 V0.1 共通関数　用途別背景色設定      V0.0=>V0.1
'
'        UPDATE          : 2011/03/24
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1. RKS231                    2011/03/24 V0.3 一時使用契約変更承諾書          V0.2=>V0.3
'                          2. RKS231                    2011/03/24 V0.3 一時使用契約変更承諾書          V0.2=>V0.3
'
'        UPDATE          : 2011/04/01
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1. FVS400                    2011/04/04 V5.7 受付入力                        V5.6=>V5.7
'                          2. MSZZ039                   2011/04/04 V2.8 共通関数 統合ヘルパー出力       V2.7=>V2.8
'
'        UPDATE          : 2011/04/01
'        UPDATER         : S.SHIBAZAKI
'        Rev             : 0.1
'                          1. FVS500                    2011/03/31 V2.6 予約入力                        V2.5=>V2.6
'                          1. MSZZ020                   2011/02/22 V0.2 共通関数　起動時マクロ用        V0.1=>V0.2
'
'        UPDATE          : 2011/04/05
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1. FVS400                    2011/04/04 V5.8 受付入力                        V5.7=>V5.8
'
'        UPDATE          : 2011/04/05
'        UPDATER         : M.RYU
'        Rev             : 0.1
'                          1. FVS400                    2011/04/05 V5.9 受付入力                        V5.8=>V5.9
'                          1. RKS240                    2011/03/15 V1.0 請求書                          V0.9=>V1.0
'
'        UPDATE          : 2011/04/06
'        UPDATER         : K.ISHIZAKA
'        Rev             : 0.0
'                          1. FTG021                    2011/04/06 V0.4 統合空詳細　メイン              V0.3=>V0.4
'
'        UPDATE          : 2011/04/15
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. FKS490                    2011/04/11 V0.4 ヤードマスタ一覧表              V0.3=>V0.4
'                          2. QKS490_M00                2011/04/11 V0.2 ヤードマスタ一覧                V0.1=>V0.2
'                          3. MFLY010                   2011/04/15 V0.9 宛名印刷 koms専用               V0.8=>V0.9
'
'        UPDATE          : 2011/04/22
'        UPDATER         : S.SHIBAZAKI
'        Rev             : 0.0
'                          1. FVS600                    2011/04/11 V2.5 契約入力                        V2.4=>V2.5
'                          2. FVS601                    2011/04/11 V2.5 契約入力                        V2.4=>V2.5
'
'        UPDATE          : 2011/04/26
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. RKS240                    2011/04/26 V1.1 請求書                          V1.0=>V1.1
'
'        UPDATE          : 2011/05/27
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. RKS240                    2011/05/27 V1.2 請求書                          V1.1=>V1.2
'
'        UPDATE          : 2011/06/02
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. FVS760                    2011/06/03 V0.4 解約メンテナンス表              V0.3=>V0.4
'                          2. RVS760                    2011/06/03 V0.8 解約メンテナンス表              V0.7=>V0.8
'                          2. FVS760_Q01                2011/06/03 V0.3 メンテナンス表                  V0.2=>V0.3
'                          3. FVS400                    2011/06/01 V6.0 受付入力                        V5.9=>V6.0
'                          4. MSZZ039                   2011/06/01 V2.9 共通関数 統合ヘルパー出力       V2.8=>V2.9
'                          5. 統合ヘルパー00.xls        承認№を削除、自習室
'                          6. 統合ヘルパー.xls          承認№を削除
'                          7. 保証会社970020.xls        承認№を削除
'                          8. コードテーブル修正        NAME_MAST、CODE_TABL
'                                                           060 88  バイク屋内・自習室
'                                                           086 8   自習室
'
'        UPDATE          : 2011/07/01
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1. FVS400                    2011/06/18 V6.1 受付入力                         V6.0=>V6.1
'                          2. MSZZ039                   2011/06/18 V3.0 共通関数 統合ヘルパー出力        V2.9=>V3.0
'                          3. MSZZ068                   2011/06/18 V0.0 共通関数 雑費自動割引
'
'        UPDATE          : 2011/07/04
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. FVS300                    2011/07/02 V0.1 毎月回収方法進捗管理            V0.0=>V0.1
'                          2. FVS300_S01                2011/07/02 V0.1 毎月回収方法進捗管理（一覧）    V0.0=>V0.1
'                          3. FVS300_S02                2011/07/02 V0.1 毎月回収方法進捗管理（検索条件）V0.0=>V0.1
'
'        UPDATE          : 2011/07/11
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.   LF0052              2011/06/30 V1.0 宛名印刷 koms専用                   V0.9=>V1.0    元MFLY010
'                          2.   LF0052S00           2011/06/30 V0.1 未収管理 宛名ﾃﾞｰﾀ抽出画面  koms専用 V0.0=>V0.1    元MFLY010S00
'                          3.   LR0052_M00          2011/06/30 V0.2 宛名印刷(小封筒) koms専用           V0.1=>V0.2    元MRLY010_M00
'                          4.   LR0052_M10          2011/06/30 V0.2 宛名印刷(中封筒) koms専用           V0.1=>V0.2    元MRLY010_M10
'                          5.   WK_LQ0052_TEMP      2010/06/30 V0.2 未収管理 宛名ﾃﾞｰﾀ                   V0.1=>V0.2    元WK_MQLY010_TEMP
'                          6.   LF0050              2011/07/07 V2.0 契約データ出力                      V1.9=>V2.0
'                          7.   LQ0050_M10          2011/07/07 V1.8 契約データ（顧客住所有り&ヤード住所無し）V1.7=>V1.8
'                          8.   LQ0050_M30          2011/07/07 V1.6 契約データ（顧客住所有り&ヤード住所有り）V1.5=>V1.6
'                          9.   FKS000              2011/07/07 V5.4 メインメニュー                      V5.3=>V5.4
'
'        UPDATE          : 2011/07/14
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. FVS760                2011/07/13 V0.9 解約メンテナンス表                  V0.8=>V0.9
'
'        UPDATE          : 2011/07/15
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. FKS600                2011/07/15 V0.1 セキュリティーカード依頼書          V0.0=>V0.1
'
'        UPDATE          : 2011/07/20
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. MSZZ039               2011/07/20 V3.1 共通関数 統合ヘルパー出力           V3.0=>V3.1
'
'        UPDATE          : 2011/07/21
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. FVS500                2011/07/19 V2.7 予約入力                            V2.6=>V2.7
'                          2. FVS400                2011/07/21 V6.2 受付入力                            V6.1=>V6.2
'
'        UPDATE          : 2011/07/21
'        UPDATER         : M.RYU
'        Rev             : 0.1
'                          1. FVS300_S02            2011/07/21 V0.2 毎月回収方法進捗管理（検索条件）    V0.1=>V0.2
'                          2. LF0015                2011/07/21 V0.3  ｺﾝﾃﾅ　宛名印刷(ﾔｰﾄﾞ)               V0.2=>V0.3
'
'        UPDATE          : 2011/07/25
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FVS021                 2010/07/25 V1.0 空状況詳細                          V1.0=>V1.1
'
'        UPDATE          : 2011/07/27
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.FTG011                 2011/07/27 V0.4 統合空状況　メイン                  V0.3=>V0.4
'                          2.FTG011_S01             2011/07/27 V0.3 統合空状況　空状況一覧              V0.2=>V0.3
'
'        UPDATE          : 2011/08/02
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FKS430                 2011/07/29 V1.2 顧客マスタ保守                      V1.1=>V1.2
'                          2.FVS920                 2011/07/30 V0.2 修理依頼書出力条件入力              V0.1=>V0.2
'                          3.Print901               2011/07/30 V0.1 ヤード修理依頼書出力                V0.0=>V0.1
'                          4.Print910               2011/07/30 V0.3 部屋修理依頼書出力                  V0.2=>V0.3
'
'        UPDATE          : 2011/08/03
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.SEL_KOKY               2011/08/03 V0.1 宛名印刷用顧客情報                  V0.0=>V0.1
'                          2.LF0052                 2011/08/03 V1.1 宛名印刷 koms専用                   V1.0=>V1.1
'
'        UPDATE          : 2011/08/09
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.MSZZ049                2011/08/09 V0.2 共通機能 解約ヘルパー出力           V0.1=>V0.2
'
'        UPDATE          : 2011/08/23
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.MSZZ039               2011/08/23 V3.2 共通関数 統合ヘルパー出力            V3.1=>V3.2
'                          2.MSZZ049               2011/08/18 V0.3 共通機能 解約ヘルパー出力            V0.2=>V0.3
'
'        UPDATE          : 2011/08/30
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FVS300                 2011/08/30 V0.2 毎月回収方法進捗管理                V0.1=>V0.2
'                          2.FVS300_S02             2011/08/30 V0.3 毎月回収方法進捗管理（検索条件）    V0.2=>V0.3
'                          3.FVS400                 2011/08/25 V6.3 受付入力                            V6.2=>V6.3
'                          4.NSZZ045                2011/08/25 V1.0 共通関数 自動割引                   V0.9=>V1.0
'
'        UPDATE          : 2011/08/30
'        UPDATER         : M.HONDA
'        Rev             : 0.1
'                          1.FKS700                 2011/08/29 V0.4 割引マスタ一覧                      V0.3=>V0.4
'                          2.FKS710                 2011/08/30 V0.6 割引マスタメンテナンス              V0.5=>V0.6
'                          3.FVS400                 2011/08/29 V6.4 受付入力                            V6.3=>V6.4
'                          4.NSZZ045                2011/08/29 V1.1 共通関数 自動割引                   V1.0=>V1.1
'
'        UPDATE          : 2011/09/05
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.NSZZ045                2011/09/05 V1.2 共通関数 自動割引                   V1.1=>1.2
'
'        UPDATE          : 2011/09/14
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FKS020_コンテナ予約入力    2011/09/14 V1.7 利用状況                        V1.6=>1.7S
'
'        UPDATE          : 2011/09/15
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.LF0052                 2011/9/15 V1.2 宛名印刷 koms専用                    V1.1=>V1.2
'
'        UPDATE          : 2011/09/22
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.RKS600                 2011/09/22 V0.2 セキュリティーカード依頼書          V0.1=>V0.2
'                          2.Print600               201/09/22 V0.1 セキュリティーカード依頼書出力       V0.0=>V0.1
'
'        UPDATE          : 2011/09/27
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FVS700                 2011/09/22 V0.9 解約入力                            V0.8=>V0.9
'
'        UPDATE          : 2011/09/29
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FVS600                 2011/09/27 V2.6 契約入力                            V2.5=>V2.6
'                          2.FVS601                 2011/09/27 V2.6 契約入力                            V2.5=>V2.6
'                          3.FVS500                 2011/09/27 V2.8 予約入力                            V2.7=>V2.8
'                          4.FVS400                 2011/09/27 V6.5 受付入力                            V6.4=>V6.5
'                          5.CmKomsMod              2011/09/27 V1.3 CmKomsMod                           V1.2=>V1.3
'                          6.FVS300                 2011/09/28 V0.3 毎月回収方法進捗管理                V0.2=>V0.3
'                          7.FVS300_S02             2011/09/28 V0.4 毎月回収方法進捗管理（検索条件）    V0.3=>V0.4
'
'        UPDATE          : 2011/09/29
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FV220                  2011/09/30 V0.1 解約ヤード・契約者状況一覧                  V0.0=>V0.1
'                          2.FV220_S01              2011/09/30 V0.1 解約ヤード・契約者状況一覧（サブフォーム）  V0.0=>V0.1
'                          3.FVS300                 2011/10/03 V0.4 毎月回収方法進捗管理                V0.3=>V0.4
'                          4.FVS300_S02             2011/10/03 V0.5 毎月回収方法進捗管理（検索条件）    V0.4=>V0.5
'                          5.MSZZ049                2011/09/30 V0.4 共通機能 解約ヘルパー出力           V0.3=>V0.4
'
'        UPDATE          : 2011/10/14
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.GenYardPage            2011/10/14 V0.5 ヤードページ生成                    V0.4=>V0.5
'                          1.FKS441                 2011/10/14 V0.3 ヤードページ生成UP                  V0.2=>V0.3
'
'        UPDATE          : 2011/10/27
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.LF0052                 2011/10/27 V1.3 宛名印刷 koms専用                    V1.2=>V1.3
'
'        UPDATE          : 2011/11/11
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FVS300                 2011/11/11 V0.5 毎月回収方法進捗管理                V0.4=>V0.5
'                          2.FVS300_S02             2011/11/11 V0.6 毎月回収方法進捗管理（検索条件）    V0.5=>V0.6
'
'        UPDATE          : 2011/11/14
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.RVS770                 2011/11/14 0.5 精算依頼リスト                       V0.4=>V0.5
'
'        UPDATE          : 2011/11/14
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FVS220                 2011/11/15 V0.2 解約ヤード・契約者状況一覧          V0.1=>V0.2
'
'        UPDATE          : 2011/11/14
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FTG011                  2011/11/24 V0.5 統合空状況　メイン                 V0.4=>V0.5
'                          2.FVS520_予約受付検索     2011/11/24 V0.1 予約受付検索                       V0.0=>V0.1
'
'        UPDATE          : 2011/11/29
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FKS430                  2011/11/29 V1.3 顧客マスタ保守                     V1.2=>V1.3
'
'        UPDATE          : 2011/12/21
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1. MSZZ039               2011/12/21 V3.3 共通関数 統合ヘルパー出力           V3.2=>V3.3
'
'        UPDATE          : 2012/01/05
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FVS300                 2012/01/05 V0.6 毎月回収方法進捗管理                V0.5=>V0.6
'                          2.FVS300_S02             2012/01/05 V0.7 毎月回収方法進捗管理（検索条件）    V0.6=>V0.7
'
'        UPDATE          : 2012/01/10
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FVS220                 2012/01/10 V0.3 解約ヤード・契約者状況一覧          V0.2=>V0.3
'
'        UPDATE          : 2012/01/11
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.FVS210                 2012/01/11 V0.2 ヤード解約業務                      V0.1=>V0.2
'                          2.MSZZ049                2012/01/11 V0.5 共通機能 解約ヘルパー出力           V0.4=>V0.5
'
'        UPDATE          : 2012/01/12
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.FVS220                 2012/01/12 V0.4 解約ヤード・契約者状況一覧          V0.3=>V0.4
'                          1.FVS700                 2012/01/12 V1.0 解約入力                            V0.9=>V1.0
'
'        UPDATE          : 2012/01/25
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.Print210               2012/01/24 V0.2 ヤード解約業務                      V0.1=>V0.2
'
'        UPDATE          : 2012/01/26
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.RKS240                 2012/01/17 V1.3 請求書                              V1.2=>V1.3
'                          2.\\Server08\system_link$\LinkDocuments\Helper\臨時請求書.xls
'
'        UPDATE          : 2012/01/30
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.FTG021                 2012/01/30 V0.5 2012/01/30 V0.5 統合空詳細　メイン  V0.4=>V0.5
'
'        UPDATE          : 2012/02/02
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.RKS240                 2012/02/02 V1.4 請求書                              V1.3=>V1.4
'
'        UPDATE          : 2012/02/03
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.LQ0050_M00             2012/02/03 V1.8 契約データ（顧客住所無し&ヤード住所無し）   V1.7=>V1.8
'                          2.LQ0050_M20             2012/02/03 V1.6 契約データ（顧客住所無し&ヤード住所有り）   V1.5=>V1.6
'
'        UPDATE          : 2012/02/09
'        UPDATER         : M.RYU
'        Rev             : 0.0
'                          1.LQ0050_M00             2012/02/09 V1.9 契約データ（顧客住所無し&ヤード住所無し）   V1.8=>V1.9
'                          2.LQ0050_M10             2012/02/09 V1.9 契約データ（顧客住所有り&ヤード住所無し）   V1.8=>V1.9
'                          3.LQ0050_M20             2012/02/09 V1.7 契約データ（顧客住所無し&ヤード住所有り）   V1.6=>V1.7
'                          4.LQ0050_M30             2012/02/09 V1.7 契約データ（顧客住所有り&ヤード住所有り）   V1.6=>V1.7
'                          4.LF0050                 2012/02/09 V2.1 契約データ出力                              V2.0=>V2.1
'
'
'        UPDATE          : 2012/03/02
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.MSZZ049                2012/03/02 V0.6 共通機能 解約ヘルパー出力           V0.5=>V0.6

'        UPDATE          : 2012/03/24
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.FVS400                 2012/03/24 V6.6 受付入力                            V6.5=>6.6
'
'        UPDATE          : 2012/04/05
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.MSZZ045　              2012/04/05 V1.3 共通関数 自動割引                   V1.2=>1.3
'                          2.FVS500　               2012/04/05 V2.9 予約入力                            V2.8=>2.9
'                          3.FKS710　               2012/04/05 V0.7 割引マスタメンテナンス              V0.6=>0.7
'
'
'        UPDATE          : 2012/04/12
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.FVS400　               2012/04/12 V6.7 受付入力                            V6.6=>6.7
'                          2.FKS140                 2012/04/12 V0.8 契約一覧表                          V0.7=>0.8
'                          3.LF0050                 2012/04/12 V2.2 契約データ出力                      V2.1=>2.2
'                          4.FVS600                 2012/04/12 V2.7 契約入力                            V2.6=>2.7
'                          5.LQ0050_M00             2012/04/12 V2.0 契約データ（顧客住所無し&ヤード住所無し）
'                          5.LQ0050_M10             2012/04/12 V2.0 契約データ（顧客住所有り&ヤード住所無し）
'                          5.LQ0050_M20             2012/04/12 V1.8 契約データ（顧客住所無し&ヤード住所有り）
'                          5.LQ0050_M30             2012/04/12 V1.8 契約データ（顧客住所有り&ヤード住所有り）
'
'        UPDATE          : 2012/04/17
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS760                   2012/04/12 V0.5 　2012/04/12 V0.5 解約メンテナンス表
'                          RVS760                   2012/04/12 V1.0 　2012/04/12 V1.0 解約メンテナンス表
'                          FVS400                   2012/04/12 V6.8 　2012/04/17 V6.8 受付入力
'
'        UPDATE          : 2012/04/27
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          RVS920　                 2012/04/27 V0.1 部屋修理依頼書                      V0.0=>0.1
'                          Print910　               2012/04/27 V0.4 部屋修理依頼書出力                  V0.3=>0.4
'
'
'        UPDATE          : 2012/05/08
'        UPDATER         : K.SHIBUYA
'        Rev             : 0.0
'                          RVS920　                 2012/05/08 V0.2 部屋修理依頼書                      V0.1=>0.2
'                          FVS400　                 2012/05/09 V6.9 受付入力                            V6.8=>6.9
'
'        UPDATE          : 2012/05/15
'        UPDATER         : K.SHIBUYA
'        Rev             : 0.0
'                          RVS920　                 2012/05/15 V0.3 部屋修理依頼書                      V0.2=>0.3
'
'        UPDATE          : 2012/06/12
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          MSZZ039　                2012/06/12 V3.4 共通関数 統合ヘルパー出力           V3.3=>3.4
'
'        UPDATE          : 2012/06/13
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FTG021　                 2012/06/13 V0.7 統合空詳細　メイン                  V0.6=>0.7
'                          FKS440_サブ価格表　      2012/06/17 V0.7 ヤードマスタメンテ（サブ）価格表    V0.6=>0.7
'
'        UPDATE          : 2012/06/27
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS601　                 2012/04/12 V2.7 契約入力                            V2.6=>2.7
'
'        UPDATE          : 2012/06/29
'        UPDATER         : K.SHIBUYA
'        Rev             : 0.0
'                          RVS901　                 2012/06/29 V0.1 ヤード修理依頼書                    V0.0=>0.1
'
'        UPDATE          : 2012/07/02
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400　                 2012/07/02 V7.0 受付入力                            V6.9=>7.0
'
'        UPDATE          : 2012/07/07
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          LF0050　                 2012/07/07 V2.5 契約データ出力                      V2.4=>V2.5
'                          LQ0050_M00               2012/07/07 V2.1 契約データ（顧客住所無し&ヤード住所無し）
'                          LQ0050_M10               2012/07/07 V2.1 契約データ（顧客住所有り&ヤード住所無し）
'                          LQ0050_M20               2012/07/07 V1.9 契約データ（顧客住所無し&ヤード住所有り）
'                          LQ0050_M30               2012/07/07 V1.9 契約データ（顧客住所有り&ヤード住所有り）
'                          FKS600_S01               2012/07/07 V0.2 セキュリティーカードマスタメンテ(サブ）
'                          CmKomsMod                2012/07/07 V1.4
'                          FKS430                   2012/07/07 V1.6 顧客マスタ保守                      V1.5=>V1.6
'                          FVS300                   2012/07/07 V0.7 毎月回収方法進捗管理                V0.6=>V0.7
'                          FVS710                   2012/07/07 V0.3 検索条件入力                        V0.2=>V0.3
'                          FVS720                   2012/07/07 V0.4 解約一覧                            V0.3=>V0.4
'
'
'        UPDATE          : 2012/07/25
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400　                 2012/07/25 V7.2 受付入力                            V7.1=>7.2
'
'        UPDATE          : 2012/08/21
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS500　                 2012/06/25 V2.9 予約入力                            V2.8=>2.9
'                          FKS440_ヤードマスタ保守  2012/08/10 V2.2 ヤードマスタメンテ                  V2.1=>2.2
'
'        UPDATE          : 2012/08/22
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          RVS760　                 2012/08/22 V1.1 解約メンテナンス表                  V1.0=>1.1
'                          FVS760                   2012/08/22 V0.6 解約メンテナンス表                  V0.5=>0.6
'
'        UPDATE          : 2012/08/30
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400　                 2012/08/30 V7.3 受付入力                            V7.2=>V7.3
'
'
'        UPDATE          : 2012/10/04
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400　                 2012/10/03  V7.3 受付入力                            V7.3=>V7.4
'                          Print910                 2012/10/03  V0.5 部屋修理依頼書出力                  V0.4=>V0.5
'                          FVS520_予約受付検索      2012/10/03  V0.2 予約受付検索                        V0.1=>V0.2
'
'
'        UPDATE          : 2012/10/09
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS100                   2012/10/04  V0.4 集計件数データ出力                  V0.3=>V0.4
'                          RVS770                   2012/10/09  V0.6 精算依頼リスト                      V0.5=>V0.6
'                          FVS770                   2012/10/09  V0.6 精算依頼リスト                      V0.5=>V0.6
'
'
'        UPDATE          : 2012/10/09
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FTG011　                 2012/10/16 V0.6 統合空状況　メイン                   V0.5=>V0.6
'                          MNN020　                 2012/10/11 V0.2 緯度・経度変換                       V0.1=>V0.2
'
'
'        UPDATE          : 2012/11/01
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS540　                 2012/11/01 V0.7 予約一覧                             V0.6=>V0.7
'                          FKS440_ヤードマスタ保守  2012/11/01 V2.3 ヤードマスタメンテ                   V2.2=>V0.2
'                          FVS770                   2012/11/01 V0.7 精算依頼リスト                       V0.6=>V0.7
'
'        UPDATE          : 2012/11/21
'        UPDATER         : K.SHIBUYA
'        Rev             : 0.0
'                          FKS430　                 2012/11/21 V1.4 顧客マスタ保守                       V1.3=>V1.4
'                          FVS500                   2012/11/21 V2.9 予約入力                             V2.8=>V2.9
'
'        UPDATE          : 2012/11/28
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS011                   2012/11/28 V1.2 空状況一覧                           V1.1=>1.2
'
'        UPDATE          : 2012/12/10
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          RVS760　                 2012/12/10 V1.2 解約メンテナンス表                   V1.1=>1.2
'                          FVS760　                 2012/12/10 V0.7 解約メンテナンス表                   V0.6=>0.7
'
'        UPDATE          : 2012/12/27
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400　                 2012/12/27 V7.6 受付入力                             V7.5=>7.6
'                          FKS440_ヤードマスタサブ  2012/12/26 V0.8 ヤードマスタメンテ（サブ）価格表     V0.7=>0.8
'                          FTG021                   2012/12/27 V0.8 統合空詳細　メイン                   V0.7=>0.8
'
'        UPDATE          : 2013/01/17
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400　                 2013/01/17 V7.7 受付入力                             V7.6=>7.7
'
'
'        UPDATE          : 2013/01/28
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400　                 2013/01/17 V7.8 受付入力                             V7.7=>7.8
'
'        UPDATE          : 2013/02/13
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS710　                 2013/02/13 V0.8 割引マスタメンテナンス               V0.7=>0.8
'
'        UPDATE          : 2013/02/21
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          Print232　               2013/02/21 V0.0 補償加入費一覧 出力
'                          FKS140　　               2013/02/21 V0.9 契約一覧表                           V0.8=>0.9
'                          FTG021_S01　             2013/02/21 V0.3 統合空詳細  上段一覧                 V0.2=>0.3
'                          FTG021_S02　             2013/02/21 V0.3 統合空詳細  下段一覧                 V0.2=>0.3
'
'
'        UPDATE          : 2013/02/22
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS600                   2013/02/22 V2.9 契約入力
'                          FVS601                   2013/02/22 V2.9 契約入力
'
'
'        UPDATE          : 2013/03/26
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          RKS600　                 2013/03/26 V0.3 セキュリティーカード依頼書          V0.2=>V0.3
'                          Print600　               2013/03/26 V0.2 セキュリティーカード依頼書出力      V0.1=>V0.2
'
'
'        UPDATE          : 2013/03/27
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          Print231　　           　2013/03/27 V0.5 一時使用契約変更承諾書出力          V0.4=>0.5
'
'
'        UPDATE          : 2013/03/30
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400　                 2013/03/30 V8.1 受付入力                            V8.0=>8.1
'                          MSZZ039　                2013/03/30 V3.4 共通関数 統合ヘルパー出力           V3.3=>3.4
'
'        UPDATE          : 2013/04/05
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          RVS760　                 2013/04/05 V1.3 解約メンテナンス表                  V1.1=>1.2
'                          FVS760　                 2013/04/05 V0.7 解約メンテナンス表                  V0.6=>0.7
'
'        UPDATE          : 2013/04/05
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          LF0050                   2013/04/10 V2.6 契約データ出力                      V2.5=>V2.6
'                          LQ0050_M00               2013/04/10 V2.2 契約データ（顧客住所無し&ヤード住所無し）V2.1 => V2.2
'                          LQ0050_M10               2013/04/10 V2.2 契約データ（顧客住所有り&ヤード住所無し）V2.1 => V2.2
'                          LQ0050_M20               2013/04/10 V2.0 契約データ（顧客住所無し&ヤード住所有り）V1.9 => V2.0
'                          LQ0050_M30               2013/04/10 V2.0 契約データ（顧客住所有り&ヤード住所有り）V1.9 => V2.0
'                          MSZZ039　                2013/04/10 V3.5 共通関数 統合ヘルパー出力                V3.4 => V3.7
'                          FVS400　                 2013/03/30 V8.1 受付入力                                 V8.2 => V8.3
'
'        UPDATE          : 2013/03/27
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          RKS231  　　           　2013/04/12 V0.4 一時使用契約変更承諾書              V0.4=>0.5
'
'        UPDATE          : 2013/04/16
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400　                 2013/04/10 V8.4 受付入力                            V8.3=V8.4
'                          MSZZ039　                2013/04/14 V3.8 共通関数 統合ヘルパー出力           V3.8=>3.9
'                          FKS000                   2013/04/16 V5.5 メインメニュー                      V5.4=>5.5
'
'        UPDATE          : 2013/04/18
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS020_コンテナ予約入力　2013/04/18 V1.9 利用状況                            V1.8=>V1.9
'                          FKS440_ヤードマスタ保守　2013/04/18 V2.4 ヤードマスタメンテ                  V2.3=>V2.4
'
'        UPDATE          : 2013/05/01
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS020_コンテナ予約入力　2013/05/01 V2.0 利用状況                            V1.9=>V2.0
'                          FKS440_ヤードマスタ保守　2013/05/01 V2.5 ヤードマスタメンテ                  V2.4=>V2.5
'                          FKS440_ヤードマスタ保守　2013/05/01 V2.5 ヤードマスタメンテ                  V2.4=>V2.5
'                          FKS140                   2013/05/01 V1.0 契約一覧表                          V0.9=>V1.0
'                          FKS140                   2013/05/01 V1.0 契約一覧表                          V0.9=>V1.0
'                          Print233                 2013/05/01 V0.0 委託料加瀬負担一覧
'                          RKS233                   2013/05/01 V0.0 委託料加瀬負担一覧
'
'        UPDATE          : 2013/05/09
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS600                   2013/05/09 V3.0 契約入力                            V2.9=>V3.0
'                          FVS601                   2013/05/09 V3.0 契約入力                            V2.9=>V3.0
'                          FTG011                   2013/05/09 V0.7 統合空状況　メイン                  V0.6=>V0.7
'                          FTG021                   2013/05/09 V0.9 統合空詳細　メイン                  V0.8=>V0.9
'
'        UPDATE          : 2013/05/17
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS440_ヤードマスタサブ下 2015/05/17 V2.1 ヤードマスタメンテ（サブ）下段     V2.0=>V2.1
'                          FKS440_ヤードマスタサブ上 2013/05/17 V2.1 ヤードマスタメンテ（サブ）上段     V2.0=>V2.1
'
'        UPDATE          : 2013/05/21
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                   2013/05/21 V8.5 受付入力                            V8.4=>V8.5
'
'
'        UPDATE          : 2013/06/03
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS500  2013/06/03 V3.0 予約入力
'                          FVS540　2013/06/03 V0.8 予約一覧
'                          FVS410　2013/06/03 V0.3 送り状リスト作成
'                          FVS300  2013/06/03 V0.8 毎月回収方法進捗管理
'                          FKS020_コンテナ予約入力　2013/06/03 V2.1 利用状況
'                          FVS600  2013/06/03 V3.1 契約入力
'                          FVS601  2013/06/03 V3.1 契約入力
'                          FKS140  2013/06/03 V1.1 契約一覧表
'                          FKS240  2013/06/03 V1.3 請求表
'                          FVS700  2013/06/03 V1.2 解約入力
'                          FVS710  2013/06/03 V0.4 検索条件入力
'                          FVS210  2013/06/03 V0.3 ヤード解約業務
'                          FVS901  2013/06/03 V0.5 ヤード修繕一覧画面
'                          FVS902  2013/06/03 V0.4 顧客修繕一覧画面
'                          FVS903　2013/06/03 V0.5 部屋修繕一覧画面
'                          FVS920　2013/06/03 V0.3 修理依頼書出力条件入力
'                          FKS440_ヤードマスタ保守 2013/06/03 V2.6 ヤードマスタメンテ
'                          FKS600  2013/06/03 V0.4 セキュリティーカードマスタメンテ
'                          FKS800  2013/06/03 V0.1 ボックスマスタメンテナンス
'                          FKS700  2013/06/03 V0.5 割引マスタ一覧
'                          FKS720　2013/06/03 V0.3 ヤード別割引一覧
'                          FKS480　2013/06/03 V0.3 顧客マスタ一覧表
'                          FKS490  2013/06/03 V0.5 ヤードマスタ一覧表
'                          FKS820  2013/06/03 V0.3 ヤードボックス情報リスト
'
'        UPDATE          : 2013/06/03
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS721  2013/06/04 V0.4 ヤード別割引設定
'                          FVS400  2013/06/04 V8.6 受付入力
'
'        UPDATE          : 2013/06/07
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          RKS600　2013/06/07 V0.3 セキュリティーカード依頼書
'
'        UPDATE          : 2013/06/12
'        UPDATER         : K.SHIBUYA
'        Rev             : 0.0
'                          FKS430　2013/06/11 V1.5 顧客マスタ保守                                         V1.4=>V1.5
'
'        UPDATE          : 2013/06/18
'        UPDATER         : K.SHIBUYA(石阪氏修正)
'        Rev             : 0.0
'                          FVS910      2013/06/17 V0.7 修繕入力ダイアログ                                 V0.6=>V0.7
'                          CmReprMod   2013/06/17 V0.4 CmReprMod                                          V0.3=>V0.4
'
'        UPDATE          : 2013/06/18
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          MSZZ039　   2013/06/18 V3.9 共通関数 統合ヘルパー出力                          V4.0=>4.1
'
'        UPDATE          : 2013/06/27
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400  2013/06/04 V8.6 受付入力                                               V8.6=>V8.7
'
'        UPDATE          : 2013/07/06
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          Print233　2013/07/06 V0.1 委託料加瀬負担一覧                                   V0.0=>V0.1
'                          RKS233    2013/07/06 V0.1 委託料加瀬負担一覧                                   V0.0=>V0.1
'
'        UPDATE          : 2013/07/08
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          CmKomsMod 2013/07/08 V1.5 CmKomsMod                                            V1.4=>V1.5
'                          FKS440_ヤードマスタ保守   2013/07/08 V2.7 ヤードマスタメンテ                   V2.6=>V2.7
'
'
'        UPDATE          : 2013/07/19
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS440_ヤードマスタ保守 　2013/07/19 V2.8 ヤードマスタメンテ                   V2.7=>V2.8
'                          FVS910                    2013/07/15 V0.8 修繕入力ダイアログ                   V0.7=>V0.8
'                          LF0050                    2013/07/19 V2.7 契約データ出力                       V2.6=>V2.7
'                          LQ0050_M40                2013/07/19 V0.0 契約データ（東都専用形式）
'                          RKS231                    2013/07/19 V0.5 一時使用契約変更承諾書               V0.5=>V0.5
'
'
'        UPDATE          : 2013/07/25
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400 　                 2013/07/25 V8.8 受付入力                             V8.7=>V8.8
'                          CmKomsMod                 2013/07/25 V1.6 CmKomsMod                            V1.5=>1.6
'
'        UPDATE          : 2013/07/30
'        UPDATER         : K.SHIBUYA
'        Rev             : 0.0
'                          FVS910 　                 2013/07/29 V0.9 修繕入力ダイアログ                   V0.8=>V0.9
'
'
'        UPDATE          : 2013/07/30
'        UPDATER         : K.SHIBUYA
'        Rev             : 0.0
'                          FKS721 2013/07/31         V0.5 ヤード別割引設定                                V0.4=>V0.5
'
'
'        UPDATE          : 2013/08/21
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS300_S02　              V0.8 毎月回収方法進捗管理                            V0.7=>V0.8
'
'
'        UPDATE          : 2013/09/07
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          RKS240　     2013/09/07 V1.5 請求書                                            V1.4=>V1.5
'                          RKS240_S10   2013/09/07 V0.4 請求書ｻﾌﾞ                                         V0.3=>V0.4
'                          QKS490_M00   2013/09/07 V0.3 ヤードマスタ一覧                                  V0.2=>V0.4
'                          FKS490       2013/09/07 V0.6 ヤードマスタ一覧表                                V0.5=>V0.6
'
'
'        UPDATE          : 2013/09/24
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS430 2013/09/24 V1.6 顧客マスタ保守                                           V1.5=>V1.6
'                          FVS600 2013/09/19 V3.2 契約入力                                                 V3.1=>V3.2
'                          FVS601 2013/09/19 V3.2 契約入力                                                 V3.1=>V3.2
'                          FTG021 2013/09/24 V1.0 統合空詳細　メイン                                       V0.9=>V1.0
'                          FVS902 2013/09/24 V0.5 顧客修繕一覧画面                                         V0.4=>V0.5
'
'        UPDATE          : 2013/09/30
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          FKS000                    2013/09/30 V5.6 メインメニュー                        V5.5=>V5.6
'
'        UPDATE          : 2013/09/30
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          FTG011                    2013/10/01 V0.8 統合空状況　メイン                    V0.7=>V0.8
'
'        UPDATE          : 2013/10/16
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          MSZZ039                   2013/10/16 V4.2 共通関数 統合ヘルパー出力             V4.1=>V4.2
'                          FVS400                    2013/10/18 V9.0 受付入力                              V8.9=>V9.0
'
'        UPDATE          : 2013/10/29
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                    2013/10/29 V9.1 受付入力                              V9.0=>V9.1
'                          MSZZ045　                 2013/10/29 V1.4 共通関数 自動割引                     V1.3=>V1.4
'
'
'        UPDATE          : 2013/10/31
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                    2013/10/31 V9.2 受付入力                              V9.1=>V9.2
'                          FKS440_ヤードマスタ保守   2013/10/31 V2.9 ヤードマスタメンテ                    V2.8=>V2.9
'
'
'        UPDATE          : 2013/11/15
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS901                    2013/11/15 V0.6 ヤード修繕一覧画面                    V0.5=>V0.6
'                          FVS902                    2013/11/15 V0.6 顧客修繕一覧画面                      V0.5=>V0.6
'                          FVS903　                  2013/11/12 V0.7 部屋修繕一覧画面                      V0.6=>V0.7
'                          FVS910　                  2013/11/15 V1.1 修繕入力ダイアログ                    V1.0=>V1.1
'                          FVS400　                  2013/11/13 V9.3 受付入力                              V9.2=>V9.3
'
'        UPDATE          : 2013/11/16
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400　                  2013/11/16 V9.4 受付入力                              V9.3=>V9.4
'                          MSZZ039                   2013/11/16 V4.3 共通関数 統合ヘルパー出力             V4.2=>V4.3
'
'
'        UPDATE          : 2013/11/20
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400　                  2013/11/20 V0.7 LF0003 V0.7 分析表（使用基準）        V0.6=>V0.7
'
'        UPDATE          : 2013/11/28
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS810　                  2013/11/18 V0.1 ボックスマスタメンテナンス（詳細）    V0.0=>V0.1
'                          FTG021　                  2013/11/27 V1.1 統合空詳細　メイン                    V1.0=>V1.1
'                          FVS500　                  2013/11/27 V3.1 予約入力                              V3.0=>V3.1
'
'        UPDATE          : 2013/12/09
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS440_ヤードマスタ保守　 2013/12/09 V3.1 ヤードマスタメンテ                    V3.0=>3.1
'
'        UPDATE          : 2013/12/11
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS800                    2013/11/22 V0.2 ボックスマスタメンテナンス            V0.1=>V0.2
'                          FKS800_S01                2013/11/22 V0.1 ボックスマスタメンテナンス（サブ）    V0.0=>V0.1
'                          FKS800_S02                2013/11/22 V0.0 ボックスマスタメンテナンス（サブ）　オーナー明細
'                          FKS810                    2013/12/06 V0.2 ボックスマスタメンテナンス（詳細）    V0.1=>V0.2
'                          FKS810_S01                2013/12/06 V0.1 ボックスマスタメンテナンス（詳細サブ）V0.0=>V0.1
'
'        UPDATE          : 2014/01/24
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS800                    2013/11/22 V0.3 ボックスマスタメンテナンス            V0.2=>V0.3
'                          FKS800_S01                2013/11/22 V0.2 ボックスマスタメンテナンス（サブ）    V0.1=>V0.2
'                          FKS800_S02                2013/11/22 V0.0 ボックスマスタメンテナンス（サブ）　オーナー明細
'                          FKS810                    2013/12/06 V0.3 ボックスマスタメンテナンス（詳細）    V0.2=>V0.3
'
'        UPDATE          : 2014/01/24
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS810                    2014/01/23 V0.4 ボックスマスタメンテナンス（詳細）    V0.3=>0.4
'
'        UPDATE          : 2014/03/28
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                    2014/03/03 V9.5 受付入力                              V9.4=>9.5
'
'        UPDATE          : 2014/03/03
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS830　                  2014/02/03 V0.0 ヤードコンテナ一覧                    V0.0
'                          FKS830_S01　              2014/02/03 V0.0 ヤードコンテナ一覧(サブ)              V0.0
'
'        UPDATE          : 2014/03/04
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS600　                  2014/03/04 V3.3 契約入力                              V3.2=>V3.3
'                          FVS601　                  2014/03/04 V3.3 契約入力                              V3.2=>V3.3
'
'        UPDATE          : 2014/03/17
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FTG021　                  2014/03/14 V1.2 統合空詳細　メイン                    V1.1=>V1.2
'                          FTG021_S01　              2014/03/17 V0.4 統合空詳細  上段一覧                  V0.3=>V0.4
'                          FTG021_S02　              2014/03/17 V0.4 統合空詳細  下段一覧                  V0.3=>V0.4
'                          KS440_ヤードマスタサブ価格表　2014/03/17 V0.9 ヤードマスタメンテ（サブ）価格表  V0.8=>V0.9
'
'        UPDATE          : 2014/03/28
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          MSZZ039                   2014/03/21 V4.4 共通関数 統合ヘルパー出力             V4.3=>4.4
'                          MSZZ070                   2014/03/05 V0.0 共通関数 自動鍵解錠番号発番           V0.0
'                          ヤード下ＷＫ              2014/03/07 V2.1 ヤードマスタメンテ（サブ）下段        V2.0=>2.1
'                          ヤード上ＷＫ              2014/03/07 V2.1 ヤードマスタメンテ（サブ）上段        V2.0=>2.1
'                          FKS440_ヤードマスタサブ下 2014/03/07 V2.2 ヤードマスタメンテ（サブ）下段        V2.1=>2.2
'                          FKS440_ヤードマスタサブ上 2014/03/07 V2.2 ヤードマスタメンテ（サブ）上段        V2.1=>2.2
'                          FKS440_ヤードマスタ保守   2014/03/07 V3.2 ヤードマスタメンテ                    V3.1=>V3.2
'                          FVS400                    2014/03/11 V9.6 受付入力                              V9.5=>V9.6
'
'        UPDATE          : 2014/04/07
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          LF0050                    2014/04/07 V2.8 契約データ出力                        V2.7=>V2.8
'                          FKS440_ヤードマスタ保守   2014/04/07 V3.3 ヤードマスタメンテ                    V3.2=>V3.3
'
'        UPDATE          : 2014/04/18
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS440_ヤードマスタ保守   2014/04/18 V3.5 ヤードマスタメンテ                    V3.4=>V3.5
'                          FVS400                    2014/04/17 V9.7 受付入力                              V9.6=>V9.7
'                          FVS600　                  2014/04/16 V3.4 契約入力                              V3.3=>V3.4
'                          FVS700　                  2014/04/11 V1.3 解約入力                              V1.2=>V1.3
'                          FVS701　                  2014/04/11 V1.3 解約入力                              V1.2=>V1.3
'                          FVS760　                  2014/04/08 V0.9 解約メンテナンス表                    V0.8=>V0.9
'                          RVS760                    2014/04/08 V1.4 解約メンテナンス表                    V1.3=>V1.4
'                          MSZZ070                   2014/04/16 V0.1 共通関数 自動鍵解錠番号発番           V0.0=>V0.1
'
'        UPDATE          : 2014/06/09
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS830　                  2014/04/21 V0.1 ヤードコンテナ一覧                    V0.0=>V0.1
'                          FKS830_S01　              2014/04/21 V0.1 ヤードコンテナ一覧(サブ)              V0.0=>V0.1
'
'
'        UPDATE          : 2014/06/10
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS760　                  2014/04/10 V1.0 解約メンテナンス表                    V0.9=>V1.0
'
'
'        UPDATE          : 2014/07/05
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          CmKomsMod                 2014/06/20 V1.7 CmKomsMod                             V1.6=>V1.7
'                          RVS760                    2014/06/24 V1.4 解約メンテナンス表                    V1.3=>V1.4
'                          FVS760                    2014/06/24 V1.1 解約メンテナンス表                    V1.0=>V1.1
'                          FVS701                    2014/06/17 V1.5 解約入力                              V1.4=>V1.5
'                          FVS700                    2014/06/17 V1.5 解約入力                              V1.4=>V1.5
'                          FVS601                    2014/06/24 V3.5 契約入力                              V3.4=>V3.5
'                          FVS600                    2014/06/24 V3.5 契約入力                              V3.4=>V3.5
'                          FVS400                    2014/06/20 V9.8 受付入力                              V9.7=>V9.8
'
'        UPDATE          : 2014/08/02
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS500                    2014/08/02 V3.2 予約入力                              V3.1=>V3.2
'                          FVS700                    2014/08/02 V1.6 解約入力                              V1.5=>V1.6
'                          RKS231                    2014/08/02 V0.6 一時使用契約変更承諾書                V0.5=>V0.6
'                          RVS760                    2014/08/02 V1.5 解約メンテナンス表                    V1.4=>V1.5
'                          MSZZ039                   2014/08/02 V4.5 共通関数 統合ヘルパー出力             V4.5=>V4.6
'
'        UPDATE          : 2014/08/27
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          MSZZ068                   2014/08/26 V0.2 共通関数 雑費自動割引                 V0.1=>V0.2
'
'
'        UPDATE          : 2014/09/30
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS760                    2014/09/30 V1.2 解約メンテナンス表                    V1.1=>V1.2
'                          FVS903                    2014/09/26 V0.8 部屋修繕一覧画面                      V0.7=>V0.8
'                          FKS240                    2014/09/30 V1.4 請求表                                V1.3=>V1.4
'
'
'        UPDATE          : 2014/10/06
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS440_ヤードマスタ保守　 2014/10/06 V3.7 ヤードマスタメンテ                    V3.6=>V3.7
'
'
'        UPDATE          : 2014/10/09
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400　2014/10/09 V9.9 受付入力
'                          MSZZ039 2014/10/09 V4.6 共通関数 統合ヘルパー出力
'
'        UPDATE          : 2014/10/09
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          RVS760　2014/10/28 V1.6 解約メンテナンス表                                      V1.5=>V1.6
'                          FVS760　2014/10/28 V1.3 解約メンテナンス表                                      V1.2=>V1.3
'
'        UPDATE          : 2014/11/12
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          MSZZ039　2014/10/14 V4.6 共通関数 統合ヘルパー出力                              V4.5=>V4.6
'                          FVS400   2014/10/14 V10.0 受付入力                                              V0.9=>V10.0
'
'        UPDATE          : 2014/11/14
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          MSZZ039　2014/11/14 V4.7 共通関数 統合ヘルパー出力                              V4.6=>V4.7
'
'        UPDATE          : 2014/11/14
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS430　2014/11/15 V1.7 顧客マスタ保守                                          V1.6=>V1.7
'
'        UPDATE          : 2014/12/03
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          Print232 2014/12/03 V0.1 補償加入費一覧 出力                                    V0.0=>V0.1
'
'        UPDATE          : 2014/12/03
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS600   2014/12/12 V3.6 契約入力                                               V3.5=>V3.6
'
'        UPDATE          : 2015/01/13
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400       2015/01/08 V10.1 受付入力                                          V10.0=>V10.1
'                          FVS540       2015/01/08 V1.0 予約一覧                                           V0.9=>V1.0
'                          FVS540_S01   2015/01/08 V0.4 予約一覧サブ（一覧）                               V0.3=>V0.4
'                          FVS540_S02   2015/01/08 V0.4 予約一覧サブ（検索条件）                           V0.3=>V0.4
'                          FKS140       2013/06/03 V1.1 契約一覧表                                         V1.0=>V1.1
'                          Print234     2015/01/08 V0.0 配送サービス一覧                                   V0.0
'
'        UPDATE          : 2015/01/13
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS540      2015/02/03 V1.1 予約一覧                                            V1.0=>V1.1
'                          FVS540_S02　2015/02/03 V0.5 予約一覧サブ（検索条件）                            V0.5=>V0.6
'
'        UPDATE          : 2015/02/05
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FTG011　2015/02/05 V0.9 統合空状況　メイン                                      V0.8=>V0.9
'
'        UPDATE          : 2015/02/06
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS500　2015/02/06 V3.5 予約入力                                                V3.4=>V3.5
'
'        UPDATE          : 2015/03/16
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          MSZZ039　2015/03/16 V4.8                                                        V4.7=>V4.8
'
'        UPDATE          : 2015/03/27
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS830   2015/03/25 V0.2 ヤードコンテナ一覧                                     V0.1=>V0.2
'                          FKS600　 2015/03/25 V0.5 セキュリティーカードマスタメンテ                       V0.4=>V0.5
'                          FVS903   2015/03/25 V0.9 部屋修繕一覧画面                                       V0.8=>V0.9
'                          FVS600　 2015/03/26 V3.7 契約入力                                               V3.6=>V3.7
'                          FVS400   2015/03/27 V10.3 受付入力                                              V10.2=>V10.3
'                          Print910 2015/03/25 V0.6 部屋修理依頼書出力                                     V0.5=>V0.6
'                          MSZZ039　2015/03/27 V4.9 共通関数 統合ヘルパー出力                              V4.8=>V4.9
'
'        UPDATE          : 2015/04/28
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400   2015/04/21 V10.4 受付入力                                              V10.3=>V10.4
'
'        UPDATE          : 2015/05/01
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS540   2015/05/01  V1.2 予約一覧                                              V1.1=>1.2
'
'        UPDATE          : 2015/05/01
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS903   2015/05/09  修繕一覧画面 V1.2                                          V1.1=>1.2
'
'        UPDATE          : 2015/05/28
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS410   2015/06/03 V0.4 送り状リスト作成                                       V0.3=>0.4
'
'        UPDATE          : 2015/08/03
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400      2015/08/03 V10.8 受付入力                                              V10.7=>10.8
'                          FVS540      2015/07/27 V1.4 予約一覧                                               V1.3=>1.4
'                          FVS540_S01  2015/07/17 V1.3 予約一覧サブ（一覧）                                   V1.2=>1.3
'                          FVS540_S02  2015/07/17 V1.3 予約一覧サブ（検索条件）                               V1.2=>1.3
'                          CmKomsMod   2015/07/26 V1.9 CmKomsMod                                              V1.8=>1.9
'                          MSZZ039     2015/07/28 V4.9 共通関数 統合ヘルパー出力                              V4.8=>4.9
'
'        UPDATE          : 2015/08/05
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400      2015/08/05 V10.9 受付入力                                              V10.8=>10.9
'                          FVS500      2015/08/05 V3.7  予約入力                                              V3.6=>3.7
'                          Print231    2015/08/05 V0.6 一時使用契約変更承諾書出力                             V0.5=>0.6
'
'        UPDATE          : 2015/08/05
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS760      2015/09/28 V1.4 解約メンテナンス表                                     V1.3=>1.4
'
'        UPDATE          : 2015/10/26
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS490       2015/10/26V0.7 ヤードマスタ一覧表                                     V0.6=>V0.7
'                          QKS490_M00   2015/10/26 V0.4 ヤードマスタ一覧                                      V0.3=>V0.4
'
'        UPDATE          : 2015/10/28
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS490       2015/10/26V0.7 ヤードマスタ一覧表                                     V0.6=>V0.7
'                          QKS490_M00   2015/10/26 V0.4 ヤードマスタ一覧                                      V0.3=>V0.4
'
'        UPDATE          : 2015/10/31
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS240       2015/10/31 V1.5 請求表                                                V1.4=>V1.5
'
'        UPDATE          : 2015/10/31
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          LF0050       2016/02/10 V2.9 契約データ出力                                         V2.8=>V2.9
'　　　　　　　　　　　　　LF0007 　　　2016/02/10 V0.4 稼動明細一覧表                                         V0.3=>V0.4
'
'        UPDATE          : 2016/06/03
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS440_ヤードマスタサブ下    2016/05/16 V2.5 ヤードマスタメンテ（サブ）下段         V2.4=>V2.5
'　　　　　　　　　　　　　FKS440_ヤードマスタサブ上　　2016/05/16 V2.5 ヤードマスタメンテ（サブ）上段         V2.4=>V2.5
'                          FKS440_ヤードマスタ保守      2016/05/16 V3.8 ヤードマスタメンテ                     V3.7=>V3.8
'                          MSZZ070                      2015/05/16 V0.2 共通関数 自動鍵解錠番号発番            V0.1=>V0.2
'                          FVS400                       2016/05/17 V11.1 受付入力                              V11.0=>V11.1
'                          FVS600                       2016/05/19 V3.8 契約入力                               V3.7=>V3.8
'                          FVS601                       2016/05/19 V3.8 契約入力                               V3.7=>V3.8
'                          FVS700                       2016/05/20 V1.7 解約入力                               V1.6=>V1.7
'                          FVS701                       2016/05/20 V1.7 解約入力                               V1.6=>V1.7
'                          MSZZ039                      2016/05/19 V5.1 共通関数 統合ヘルパー出力              V5.0=>V5.1
'
'        UPDATE          : 2016/08/09
'        UPDATER         : K.SHIBUYA
'        Rev             : 0.0
'                          FKS440_ヤードマスタ保守      2016/08/09 V4.0 ヤードマスタメンテ                     V3.9=>V4.0
'
'        UPDATE          : 2016/11/17
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          LF0050                       2016/11/17 V4.0 契約データ出力                         V3.9=>V4.0
'
'        UPDATE          : 2016/11/22
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          RVS770                       2016/11/22 0.7 精算依頼リスト                          V0.6=>V0.7
'
'        UPDATE          : 2016/12/14
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          MSZZ045                      2016/12/14 V1.5 共通関数 自動割引                      V1.4=>V1.5
'                          FKS440                       2016/12/14 V2.6 FKS440_ヤードマスタサブ下              V2.4=>V2.5
'                          FKS800                       2016/12/14 V0.4 コンテナ管理                           V0.3=>V0.4
'
'        UPDATE          : 2017/1/26
'        UPDATER         : K.SHIBUYA
'        Rev             : 0.0
'                          RVS920                       2017/01/26 V0.4 部屋修理依頼書                         V0.3=>V0.4
'                          RVS901                       2017/01/26 V0.2 ヤード修理依頼書                       V0.1=>V0.2
'
'        UPDATE          : 2017/2/4
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                       2017/02/04 V11.2 受付入力                              V11.1=>V11.2
'
'        UPDATE          : 2017/2/9
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          LF0050                       2017/02/08 V3.1 契約データ出力                               V3.0=>V3.1
'                          LQ0050_M00                   2017/02/08 V2.3 契約データ（顧客住所無し&ヤード住所無し）    V2.2=>V2.3
'
'        UPDATE          : 2017/02/10
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS600                       2017/02/10 V3.9 契約入力                                V3.8=>V3.9
'                          FVS601                       2017/02/10 V3.9 契約入力                                V3.8=>V3.9
'
'        UPDATE          : 2017/04/18
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS530                       2017/04/01 V0.2 ご紹介連絡表                            V0.1=>V0.2
'                          Print530                     2017/04/01 V0.4 ご紹介連絡表出力処理                    V0.3=>V0.4
'
'        UPDATE          : 2017/06/22
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS410                       2017/06/22 V0.5 送り状リスト作成                        V0.4=>V0.5
'
'        UPDATE          : 2017/06/22
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400 　　　　　　　　　　　2017/07/06 V11.3 受付入力                               V11.2=>11.3
'
'        UPDATE          : 2017/07/15
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS440                       2017/07/15 V4.2 ﾔｰﾄﾞマスタ保守                          V4.2=>V4.3
'
'        UPDATE          : 2017/07/29
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS600                       2017/07/29 V4.0 契約入力                                V3.9=>V4.0
'
'        UPDATE          : 2017/07/29
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS600                       2017/07/29 V4.0 契約入力                                V3.9=>V4.0
'                          CmKomsMod                    2017/07/29 V2.0 CmKomsMod                               V1.9=>V2.0
'                          QKS490_M00                   2017/07/29 V0.5 ヤードマスタ一覧                        V0.4=>V0.5
'                          FKS490                       2017/07/29 V0.8 ヤードマスタ一覧表                      V0.7=>V0.8
'
'
'        UPDATE          : 2017/09/07
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                       2017/09/07 V11.3 受付入力                               V11.2=>V11.3
'                          CmKomsMod                    2017/07/29 V2.0 CmKomsMod                               V1.9=>V2.0
'                          FVS500                       2017/07/29 V3.8 予約入力                                V3.7=>V3.8
'                          FKS020                       2017/09/07 V2.3 利用状況                                V2.2=>V2.3
'                          FKS440                       2017/09/07 V4.3 ヤードマスタ保守                        V4.2=>V4.3
'
'        UPDATE          : 2017/10/10
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS770                       2017/10/10 V0.9 精算依頼リスト                          V0.8=>V0.9
'
'        UPDATE          : 2017/11/07
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ049                      2017/11/02 V0.8 共通機能 解約ヘルパー出力               V0.7=>V0.8
'
'        UPDATE          : 2017/11/27
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS000                       2017/11/05 V5.8 メインメニュー                          V5.6=>V5.8
'                          FVS904                       2017/11/03 V0.0 ヤード一括修繕一覧画面                  V0.0
'                          FVS904_S01                   2017/11/03 V0.0 ヤード一括修繕一覧画面                  V0.0
'                          FVS904_W01                   2017/10/10 V0.1 一括修繕一覧                            V0.1
'                          FVS904_sub                   2017/11/13 V0.0 一括修繕一覧用共通関数                  V0.0
'                          FVS910　                     2017/11/11 V1.2 修繕入力ダイアログ                      V1.1=>V1.2
'                          Print910                     2017/11/18 V0.7 部屋修理依頼書出力                      V0.6=>V0.7
'
'        UPDATE          : 2017/12/04
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS240                       2017/12/02 V1.7 請求表                                  V1.5=>V1.7
'
'        UPDATE          : 2017/12/11
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS000                       2017/12/11 V5.9 メインメニュー                          V5.8=>V5.9
'                          QKS490_M00                   2017/10/12 V0.6 ヤードマスタ一覧                        V0.5=>V0.6
'                          FKS440                       2017/10/20 V4.4 ヤードマスタ保守                        V4.3=>V4.4
'                          FKS450                       2017/12/01 V1.1 価格テンプレート設定ヤード一覧          V1.1
'                          FKS450_S01                   2017/12/01 V1.1 価格テンプレート設定ヤード一覧(サブ)    V1.1
'                          FKS460                       2017/12/01 V1.1 価格テンプレートマスタメンテ            V1.0
'                          FKS460_S01                   2017/12/01 V1.1 価格テンプレートマスタメンテ(サブ)      V1.0
'                          FKS490                       2017/10/12 V0.9 ヤードマスタ一覧表                      V0.8=>V0.9
'                          RKS490                       2017/10/12 V0.3 ヤードマスタ一覧表(REP)                 V0.2=>V0.3
'
'        UPDATE          : 2017/12/20
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          Print530                     2017/12/20 V0.5 ご紹介連絡表出力処理                    V0.4=>V0.5
'
'        UPDATE          : 2017/12/26
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS700                       2017/12/01 V0.6 割引マスタ一覧                          V0.5=>V0.6
'                          FKS700_S01                   2017/12/01 V0.6 割引マスタ一覧(サブ)                    V0.5=>V0.6
'
'        UPDATE          : 2017/12/28
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2017/12/27 V5.2 共通関数 統合ヘルパー出力               V5.1=>V5.2
'
'        UPDATE          : 2018/01/09
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MNR400                       2017/12/01 V1.0 サービス内容夜間設定                    V1.0
'
'        UPDATE          : 2018/01/20
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS490                       2018/01/20 V1.0 ヤードマスタ一覧表                      V0.9=>V1.0
'                          QKS490_M00                   2018/01/20 V0.7 ヤードマスタ一覧                        V0.6=>V0.7
'
'        UPDATE          : 2018/01/24
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          RKS240　                     2018/01/24 V1.7 請求書                                  V1.6=>V1.7
'
'        UPDATE          : 2018/01/29
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2018/01/29 V12.1 受付入力                               V11.9=>V12.1
'                          FKS450                       2018/01/26 V1.2  価格テンプレート設定ヤード一覧         V1.1 =>V1.2
'                          FKS430　                     2018/01/18 V1.8  顧客マスタ保守                         V1.7 =>V1.8
'                          RKS231                       2018/01/28 V0.7 一時使用契約変更承諾書                  V0.6 =>V0.7
'                          RKS240　                     2018/01/28 V1.8 請求書                                  V1.7 =>V1.8
'
'        UPDATE          : 2018/01/29
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2018/01/29 V12.2 受付入力                               V12.1=>V12.2
'                          FVS600                       2018/02/10 V4.1  契約入力                               V4.0 =>V4.1
'
'        UPDATE          : 2018/02/15
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          Print530                     2018/02/15 V0.6  ご紹介連絡表出力処理                   V0.5 =>V0.6
'                          FVS400                       2018/02/15 V12.3 受付入力                               V12.2=>V12.3
'
'        UPDATE          : 2018/02/17
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS500                       2018/02/17 V3.9 予約入力                                V3.8 =>V3.9
'
'        UPDATE          : 2018/02/19
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2018/02/19 V12.4 受付入力                               V12.3=>V12.4
'
'        UPDATE          : 2018/03/01
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS500                       2018/03/01 V4.0 予約入力                                V3.9 =>V4.0
'
'        UPDATE          : 2018/03/10
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2017/12/27 V5.2 共通関数 統合ヘルパー出力               V5.2 =>V5.3
'                          MSZZ049                      2017/11/02 V0.8 共通機能 解約ヘルパー出力               V0.8 =>V0.9
'
'        UPDATE          : 2018/03/16
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                       2018/03/16 V12.5 受付入力                               V12.4 =>V12.5
'                          FKS020_コンテナ予約入力      2018/03/16 V2.4 利用状況                                V2.3  =>V2.5
'                          FKS800                       2018/03/16 V0.5 ボックスマスタメンテナンス              V0.4  =>V0.5
'                          FVS500                       2018/03/17 V4.1 予約入力　　　　　　　　　　            V4.0  =>V4.1
'                          LF0050                       2018/03/17 V3.2 契約データ出力　　　　　　　            V3.1  =>V3.2
'
'        UPDATE          : 2018/03/19
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          MSZZ039                      2018/03/19 V5.4 共通関数 統合ヘルパー出力               V5.3 =>V5.4
'
'        UPDATE          : 2018/03/19
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS210                       2018/02/22 V0.4 ヤード解約業務                          V0.3 =>V0.4
'                          Print210                     2018/02/22 V0.3 ヤード解約業務                          V0.2 =>V0.3
'
'        UPDATE          : 2018/03/27
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS540                       2018/03/27 V1.5 予約一覧                                V1.4 =>V1.5
'
'        UPDATE          : 2018/03/28
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                       2018/03/28 V12.6 受付入力                               V12.5 =>V12.6
'
'        UPDATE          : 2018/03/31
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                       2018/03/19 V12.7 受付入力                               V12.6 =>V12.7
'                          CmKomsMod                    2018/03/19 V2.1  受付入力                               V2.1  =>V2.1
'
'        UPDATE          : 2018/04/03
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS440_ヤードマスタサブ価格表  2018/04/03 V1.0 ヤードマスタメンテ（サブ）価格表
'
'        UPDATE          : 2018/04/26
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          LQ0050_M00                 2018/04/26 V2.4 契約データ（顧客住所無し&ヤード住所無し） V2.3 =>V2.4
'                          LQ0050_M10                 2018/04/26 V2.3 契約データ（顧客住所有り&ヤード住所無し） V2.2 =>V2.3
'                          LQ0050_M20                 2018/04/26 V2.1 契約データ（顧客住所無し&ヤード住所有り） V2.0 =>V2.1
'                          LQ0050_M30                 2018/04/26 V2.1 契約データ（顧客住所有り&ヤード住所有り） V2.0 =>V2.1
'                          LF0050                     2018/03/17 V3.2 契約データ出力                            V3.1 =>V3.2
'
'        UPDATE          : 2018/05/08
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                     2018/05/08 V12.8 受付入力                                 V12.7 =>V12.8
'
'        UPDATE          : 2018/05/17
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                     2018/05/17 V12.9 受付入力                                 V12.8 =>V12.9
'
'        UPDATE          : 2018/05/21
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                     2018/05/21 V13.0 受付入力                                 V12.9 =>V13.0
'
'        UPDATE          : 2018/05/23
'        UPDATER         : K.SHIBUYA
'        Rev             : 0.0
'                          FVS540_S02                 2018/05/23 V1.4 予約一覧サブ（検索条件）                  V1.3  =>V1.4
'                          CmKomsMod                  2018/05/23 V2.2  受付入力                                 V2.1  =>V2.2
'
'        UPDATE          : 2018/06/18
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                     2018/06/18 V13.1 受付入力                                 V13.0  =>V13.1
'
'        UPDATE          : 2018/06/25
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS210                     2018/06/21 V0.6 ヤード解約業務                            V0.5   =>V0.6
'                          Print210                   2018/06/17 V0.4 ヤード解約業務                            V0.3   =>V0.4
'
'
'        UPDATE          : 2018/07/09
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                     2018/07/09 V13.2 受付入力                                 V13.1  =>V13.2
'
'        UPDATE          : 2018/07/17
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                     2018/07/17 V13.3 受付入力                                 V13.2  =>V13.3
'
'        UPDATE          : 2018/07/21
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                        : MSHS012                    2018/07/21 V0.4 テーブルリンク(KOMS)                      V0.3   =>V0.4
'
'        UPDATE          : 2018/07/27
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS810                     2018/07/27 V0.5 ボックスマスタメンテナンス（詳細）        V0.4   =>V0.5
'
'        UPDATE          : 2018/08/04
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS240                     2018/08/04 V1.9 請求表                                    V1.7   =>V1.9
'
'        UPDATE          : 2018/08/09
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS440                     2018/07/24 V4.7 ヤードマスタ保守                          V4.6   =>V4.7
'
'        UPDATE          : 2018/08/17
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS440                     2018/08/16 V4.8 ヤードマスタ保守                          V4.7   =>V4.8
'
'        UPDATE          : 2018/08/21
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS600                     2018/08/21  V4.2 契約入力                                  V4.1   =>V4.2
'
'        UPDATE          : 2016/06/03
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS700                     2018/08/29  V1.9 解約入力                                  V1.8   =>V1.9
'
'        UPDATE          : 2018/09/10
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS830                     2018/09/07  V0.3 ヤードコンテナ一覧                        V0.2   =>V0.3
'
'        UPDATE          : 2018/09/15
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ021                    2018/09/15  V0.8 共通関数　メール送信                      V0.7   =>V0.8
'
'        UPDATE          : 2018/09/17
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2018/08/30 V13.5 受付入力                               V13.3  =>V13.5
'                          FVS500                        2018/08/30 V4.3  予約入力　　　　　　　　　　           V4.1  =>V4.3
'                          FKS440_ヤードマスタ保守       2018/08/20 V4.9  ヤードマスタメンテ                     V4.8   =>V4.9
'                          FKS440_ヤードマスタサブ上     2018/08/20 V2.5  ヤードマスタメンテ（サブ）上段         V2.4   =>V2.5
'                          FKS440_ヤードマスタサブ下     2018/08/20 V2.7  ヤードマスタメンテ（サブ）下段         V2.6   =>V2.7
'                          FKS440_ヤードマスタサブ価格表 2018/08/20 V1.0  ヤードマスタメンテ（サブ）価格表       V1.0
'                          ヤード上ＷＫ                  2018/08/20 V2.0  ヤードマスタメンテ（サブ）上段         V0.6   =>V2.0
'                          ヤード下ＷＫ                  2018/08/20 V2.0  ヤードマスタメンテ（サブ）下段         V0.6   =>V2.0
'                          FKS440_W02                    2018/08/20 V0.2  価格表リスト                           V0.1   =>V0.2
'                          FKS450                        2018/08/11 V1.3  価格テンプレート設定ヤード一覧         V1.2   =>V1.3
'                          FKS450_S01                    2018/08/11 V1.3  価格テンプレート設定ヤード一覧(サブ)   V1.1   =>V1.3
'                          FKS460                        2018/08/01 V1.1  価格テンプレートマスタメンテ           V1.0   =>V1.1
'                          FKS460_S01                    2018/08/01 V1.1  価格テンプレートマスタメンテ(サブ)     V1.0   =>V1.1
'                          FKS460_W01                    2018/08/01 V1.1  価格テンプレートマスタ（ヘッダ）       V1.0   =>V1.1
'                          MSZZ039                       2018/08/25 V5.6  共通関数 統合ヘルパー出力              V5.4   =>V5.6
'
'        UPDATE          : 2018/09/29
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                        2018/09/25 V13.7 受付入力                               V13.5  =>V13.6
'                          FVS500                        2018/09/25 V4.4  予約入力                               V4.3   =>V4.4
'                          CmKomsMod                     2018/09/25 V2.3 CmKomsMod                               V2.2   =>V2.3
'                          MSZZ039                       2018/09/25 V5.7 共通関数 統合ヘルパー出力               V5.6   =>V5.7
'                          MSZZ049                       2018/09/25 V0.8 共通関数 解約ヘルパー出力               V0.7   =>V0.8
'
'        UPDATE          : 2018/10/10
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2018/10/10 V13.9 受付入力                               V13.7  =>V13.9
'                          FKS440_ヤードマスタ保守       2018/10/10 V5.0  ヤードマスタメンテ                     V4.9   =>V5.0
'                          MSZZ039                       2018/10/10 V5.8 共通関数 統合ヘルパー出力               V5.7   =>V5.8
'                          Print231                      2018/09/21 V0.7  一時使用契約変更承諾書出力             V0.6   =>0.7
'
'        UPDATE          : 2018/10/15
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS240                        2018/10/15 V2.0 請求表                                  V1.9   =>V2.0
'
'        UPDATE          : 2018/10/19
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS440_ヤードマスタ保守       2018/10/10 V5.0  ヤードマスタメンテ                     V5.0   =>V5.1
'
'        UPDATE          : 2018/10/25
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2018/10/23 V14.0 受付入力                               V13.9  =>V14.0
'
'        UPDATE          : 2018/11/28
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          RKS240　                      2018/11/28 V1.8 請求書                                  V1.7 =>V1.8
'
'        UPDATE          : 2018/11/29
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS450                        2018/11/15 V1.4  価格テンプレート設定ヤード一覧         V1.3 =>V1.4
'
'        UPDATE          : 2018/12/15
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS240                        2018/12/15 V2.1 請求表                                  V2.0 =>V2.1
'                          RKS240　                      2018/12/15 V2.1 請求書                                  V1.9 =>V2.1
'                          FKS440_ヤードマスタ保守       2018/11/14 V5.3 ヤードマスタメンテ                      V5.1 =>V5.3
'                          CmKeyPress                    2018/11/14 V0.1 CmKeyPress                              V0.0 =>V0.1
'
'        UPDATE          : 2019/01/12
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS240                        2019/01/12 V2.2 請求表                                  V2.1 =>V2.2
'                          WebSeikyu                     2019/01/12 V0.0 Web請求関数群                           V0.0
'                          JsonConverter                 2019/01/12 V2.2 VBA-JSON                                V0.0
'
'        UPDATE          : 2019/02/06
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          RKS240　                      2019/02/04 V2.2  請求書                                 V2.1  =>V2.2
'                          FVS500                        2019/02/05 V4.5  予約入力                               V4.4  =>V4.5
'                          FVS400                        2019/02/06 V14.1 受付入力                               V14.0 =>V14.1
'
'        UPDATE          : 2019/02/14
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                        2019/02/14 V14.2 受付入力                               V14.1 =>V14.2
'
'        UPDATE          : 2019/02/19
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS600                        2019/02/19 V4.3 契約入力                                V4.2  =>V4.3
'                          RKS231                        2018/02/19 V0.8 一時使用契約変更承諾書                  V0.7  =>V0.8
'
'        UPDATE          : 2019/03/01
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          LF0050                        2018/03/01 V3.4 契約データ出力                          V3.3  =>V3.4
'
'        UPDATE          : 2019/03/08
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2019/03/04 V14.3 受付入力                               V14.2 =>V14.3
'
'        UPDATE          : 2019/03/15
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2019/03/14 V14.4 受付入力                               V14.3 =>V14.4
'                          FVS500                        2019/03/14 V4.6  予約入力                               V4.5  =>V4.6
'                          CmKomsMod                     2019/03/14 V2.4  CmKomsMod                              V2.3  =>V2.4
'
'        UPDATE          : 2019/03/25
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS000                        2019/03/25 V6.0                                         V5.9  =>V6.0
'                          FVS500                        2019/03/25 V4.7                                         V4.6  =>V4.7
'                          FVS910                        2019/03/25 V1.3                                         V1.2  =>V1.3
'                          FKS700                        2019/03/25 V0.8                                         V0.7  =>V0.8
'
'        UPDATE          : 2019/04/02
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          RKS231                        2018/04/02 V0.9 一時使用契約変更承諾書                  V0.8  =>V0.9
'
'        UPDATE          : 2019/04/11
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                        2019/04/11 V14.6 受付入力                               V14.5 =>V14.6
'                          FKS440_ヤードマスタ保守       2019/04/09 V5.5 ヤードマスタメンテ                      V5.3  =>V5.5
'
'        UPDATE          : 2019/04/17
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS440_ヤードマスタ保守       2019/04/11 V5.6 ヤードマスタメンテ                      V5.5  =>V5.6
'
'        UPDATE          : 2019/04/22
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          1.FVS021                      2019/04/22 V1.2 空状況詳細                              V1.1  =>V1.2
'
'        UPDATE          : 2019/04/23
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          1.FKS430                      2019/04/23 V1.9 顧客マスタ保                            V1.8  =>V1.9
'
'        UPDATE          : 2019/04/26
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS240                        2019/04/26 V2.4 請求表                                  V2.2  =>V2.4
'
'        UPDATE          : 2019/05/07
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS520                        2019/05/07 V0.3 予約受付検索                            V.02  =>V0.3
'
'        UPDATE          : 2019/05/08
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                        2019/05/08 V14.7 受付入力                               V.14.6=>V14.7
'
'        UPDATE          : 2019/05/13
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS600                        2019/04/23 V4.4 契約入力                                V4.3  =>V4.4
'                          FVS601                        2019/04/23 V4.4 契約入力                                V4.3  =>V4.4
'                          FVS610                        2019/04/10 V1.0 ネット解約申込・取消確認                V1.0
'                          FVS710                        2019/04/10 V0.5 検索条件入力                            V0.4  =>V0.5
'                          FVS720                        2019/04/10 V0.5 解約一覧                                V0.4  =>V0.5
'                          MSZZ026                       2007/08/14 V0.1 共通関数 XMLHTTPアクセス                V0.1
'                          MSZZ034                       2011/02/17 V0.1 共通関数 UTF8形式ファイル関数           V0.1
'                          MSZZ035                       2019/04/10 V0.5 共通関数 コンバート関数                 V0.5
'                          MSZZ062                       2011/01/24 V0.0 共通関数　EUC形式ファイル関数認         V0.0
'                          MSZZ073                       2018/01/13 V0.1 ReCaRo8接続                             V0.1
'                          MSZZ073K                      2019/03/30 V0.0 KOMS2020接続                            V0.0
'                          MSZZ074                       2019/03/14 V0.1 AES復号化                               V0.1
'                          MSZZ075                       2017/01/26 V0.0 WindowsAPIで発生したエラー文言取得      V0.0
'                          FVS720_W03                    2019/04/11 V0.1 解約一覧(Excelファイル出力用)           V0.1
'
'        UPDATE          : 2019/05/14
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          MSZZ039                       2019/05/14 V5.9 共通関数 統合ヘルパー出力
'
'        UPDATE          : 2019/05/20
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS500                        2019/05/20 V4.8 予約入力                                V4.7 =>V4.8
'
'        UPDATE          : 2019/05/23
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS720                        2019/05/23 V0.6  解約一覧入力                           V0.6 =>V0.7
'
'        UPDATE          : 2019/06/10
'        UPDATER         : Y.WADA
'        Rev             : 0.0
'                          1.FKS430                      2019/05/01 V2.0 顧客マスタ保守                          V1.9 =>V2.0
'                          2.FVS400                      2019/05/01 V14.8 受付入力                               V14.7=>V14.8
'                          3.MSHS013                     2019/05/14 V0.2 KASE_DBテーブルリンク(KOMS用)           V0.1 =>0.2
'
'        UPDATE          : 2019/06/15
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS600                        2019/06/15 V4.5 契約入力                                V4.4  =>V4.5
'                          FVS601                        2019/06/15 V4.5 契約入力                                V4.4  =>V4.5
'
'        UPDATE          : 2019/07/08
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS600                        2019/06/15 V1.1 FKS440_ヤードマスタサブ価格表           V1.0  =>V1.1
'
'        UPDATE          : 2019/07/08
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          LF0007                        2019/07/09 V0.5 稼動明細一覧表                          V0.4  =>V0.5
'                          FKS490                        2019/07/09 V1.1 ヤードマスタ一覧表                      V1.0  =>V1.1
'
'        UPDATE          : 2019/07/11
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          LF0015                        2019/07/11 V0.4  ｺﾝﾃﾅ　宛名印刷(ﾔｰﾄﾞ)                   V0.3  =>V0.4
'
'        UPDATE          : 2019/08/06
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                        2019/06/24 V14.9 受付入力                               V1.8  =>V1.9
'
'        UPDATE          : 2019/08/19
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS500                        2019/08/19 V5.0 予約入力                                V4.9  =>V5.0
'
'        UPDATE          : 2019/08/19
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                        2019/08/08 V15.0 受付入力                               V14.9  =>V15.0
'
'        UPDATE          : 2019/04/26
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS240                        2019/08/15 V2.5 請求表                                  V2.4  =>V2.5
'                          RKS240　                      2019/08/15 V2.4 請求書                                  V2.3  =>V2.4
'
'        UPDATE          : 2019/09/07
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS140                        2019/09/07 V1.4 契約一覧表                              V1.3  =>V1.4
'                          RKS240　                      2019/08/15 V2.4 請求書                                  V2.3  =>V2.4
'
'        UPDATE          : 2019/09/18
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2019/09/06 V15.2 受付入力                               V15.0 =>V15.2
'                          CmKomsMod                     2019/08/15 V2.6  CmKomsMod                              V2.4  =>V2.6
'                          MSZZ039                       2019/08/15 V5.9 共通関数 統合ヘルパー出力
'
'        UPDATE          : 2019/09/26
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS440_ヤードマスタ保守       2019/08/22 V5.7 ヤードマスタ保守                        V5.6  =>V5.7
'                          FVS400                        2019/09/27 V15.3 受付入力                               V15.2 =>V15.3
'                          MSZZ039                       2019/09/25 V6.1 共通関数 統合ヘルパー出力
'
'        UPDATE          : 2019/10/01
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                       2019/09/26 V6.2 共通関数 統合ヘルパー出力               V6.1  =>V6.2
'
'        UPDATE          : 2019/10/23
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          LF0007                        2019/10/23 V0.7 稼動明細一覧表                          V0.6  =>V0.7
'
'        UPDATE          : 2019/11/01
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          LF0050                        2018/03/01 V3.4 契約データ出力                          V3.4  =>V3.5
'                          MSZZ002                       2011/10/31 V0.8 DB_汎用関数                             V0.7  =>V0.8
'                          MSZZ053                       2019/11/01 V1.7 共通関数　EXCEL出力                     V1.7
'
'        UPDATE          : 2019/11/08
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          WebSeikyu                     2019/10/19 V0.1 Web請求関数群                           V0.0  =>V0.1
'
'        UPDATE          : 2019/11/20
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                        2019/11/20 V15.4 受付入力                               V15.3  =>V15.4
'
'        UPDATE          : 2019/12/03
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          FKS020_コンテナ予約入力       2019/11/20 V2.5 利用状況                                V2.4  =>V2.5
'                          FKS020_コンテナ予約入力サブオーナー 2019/11/20 V0.0 利用状況オーナー                  V0.0
'                          MSZZ080                       2019/12/01 V0.0 他システムの画面起動                    V0.0
'
'        UPDATE          : 2019/12/03
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          FKS020_コンテナ予約入力       2019/12/11 V2.7 利用状況                                V2.5  =>V2.7
'
'        UPDATE          : 2019/12/16
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS410                        2019/12/16 V0.6 送り状リスト作成                        V0.5  =>V0.6
'
'        UPDATE          : 2019/12/16
'        UPDATER         :
'        Rev             : 0.0
'                          FVS410                        2019/12/16 V0.6 送り状リスト作成                        V0.5  =>V0.6
'
'        UPDATE          : 2019/12/23
'        UPDATER         :
'        Rev             : 0.0
'                          RKS231                        2019/12/23 V1.0 一時使用契約変更承諾書                  V0.9  =>V1.0
'
'        UPDATE          : 2020/01/07
'        UPDATER         :
'        Rev             : 0.0
'                          FVS500                        2020/01/07 V5.1 予約入力                                V5.0  =>V5.1
'
'        UPDATE          : 2020/02/06
'        UPDATER         :
'        Rev             : 0.0
'                          FVS500                        2020/02/06 V5.3 予約入力                                V5.2  =>V5.3
'
'        UPDATE          : 2020/02/15
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          LF0060                        2019/11/20 V0.0 コンテナ在庫一覧表                      V0.0
'                          LS0060                        2019/11/20 V0.0 コンテナ在庫一覧表(EXCEL)               V0.0
'                          LS0060A                       2019/11/20 V0.0 コンテナ在庫一覧表(データ更新)          V0.0
'
'        UPDATE          : 2020/02/17
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          LF0060                        2020/02/15 V0.1 コンテナ在庫一覧表                      V0.0
'                          LS0060A                       2020/02/15 V0.1 コンテナ在庫一覧表(データ更新)          V0.0
'
'        UPDATE          : 2020/02/27
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2020/02/20 V15.5 受付入力                               V15.4 =>V15.5
'
'        UPDATE          : 2020/02/28
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS500                        2020/02/28 V5.4 予約入力                                V5.3  =>V5.4
'                          FVS520                        2020/02/28 V0.4 予約受付検索                            V0.3  =>V0.4
'
'        UPDATE          : 2020/03/05
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2020/02/25 V15.5 受付入力                               V15.5 =>V15.6
'                          MSZZ039                       2020/01/24 V6.3 共通関数 統合ヘルパー出力               V6.2  =>V6.3
'
'        UPDATE          : 2020/03/12
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          MSZZ080                       2022/02/22 V0.1 他システムの画面起動                    V0.0  =>V0.1
'
'        UPDATE          : 2020/03/17
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2020/03/17 V15.6 受付入力                               V15.6 =>V15.7
'
'        UPDATE          : 2020/03/24
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS240                        2020/03/24 V2.7 請求表                                  V2.6  =>V2.7
'
'        UPDATE          : 2020/03/30
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          CmKomsMod                     2020/03/30 V2.7 請求表                                  V2.6  =>V2.7
'
'        UPDATE          : 2020/04/01
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          CmKomsMod                     2020/04/01 V2.8 請求表                                  V2.7  =>V2.8
'                          FVS400                        2020/04/01 V15.8 受付入力                               V15.7 =>V15.8
'
'        UPDATE          : 2020/04/03
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                       2020/04/03 V6.4 共通関数 統合ヘルパー出力               V6.3  =>V6.4
'
'        UPDATE          : 2020/04/06
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS240                        2020/04/06 V2.8 請求表                                  V2.7  =>V2.8
'
'        UPDATE          : 2020/05/09
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          LF0050                        2020/05/09 V3.7 契約データ出力                          V3.5  =>V3.7
'
'        UPDATE          : 2019/05/23
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS000                        2020/05/23 V6.1                                         V60.  =>V6.1
'
'        UPDATE          : 2020/05/27
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2020/05/01 V15.9 受付入力                               V15.8 =>V15.9
'                          MSZZ039                       2020/05/01 V6.5  共通関数 統合ヘルパー出力              V6.4  =>V6.5
'
'        UPDATE          : 2020/06/05
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          LS0060A                       2020/06/04 V0.2 コンテナ在庫一覧表(データ更新)          V0.1  =>V0.2
'
'        UPDATE          : 2020/06/11
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          LF0060                        2020/06/09 V0.2 コンテナ在庫一覧表                      V0.1  =>V0.2
'                          LS0060                        2020/06/09 V0.1 コンテナ在庫一覧表(EXCEL)               V0.0  =>V0.1
'                          LS0060A                       2020/06/09 V0.3 コンテナ在庫一覧表(データ更新)          V0.2  =>V0.3
'
'        UPDATE          : 2020/06/12
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          LS0060A                       2020/06/12 V0.4 コンテナ在庫一覧表(データ更新)          V0.3  =>V0.4
'
'        UPDATE          : 2020/06/13
'        UPDATER         : Y.WADA
'        Rev             : 0.0
'                          1.LF0060                      2020/06/12 V0.3 コンテナ在庫一覧表                      V0.2  =>V0.3
'                          2.LS0060B                     2020/06/12 V0.0 コンテナ在庫一覧表（サマリ）(EXCEL)     V0.0
'
'        UPDATE          : 2020/05/29
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                       2020/05/29 V6.6 共通関数 統合ヘルパー出力               V6.5  =>V6.6
'
'        UPDATE          : 2020/06/18
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          LF0060                        2020/06/18 V0.5 コンテナ在庫一覧表(データ更新)          V0.4  =>V0.5
'
'        UPDATE          : 2020/07/06
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS240                        2020/07/03 V2.9 請求表                                  V2.8  =>V2.9
'
'        UPDATE          : 2020/07/13
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          LF0060                        2020/07/07 V0.4 コンテナ在庫一覧表                      V0.3  =>V0.4
'                          LS0060                        2020/06/09 V0.1 コンテナ在庫一覧表(EXCEL)               V0.0  =>V0.1
'                          LS0060A                       2020/07/07 V0.6 コンテナ在庫一覧表(データ更新)          V0.5  =>V0.6
'                          LF0060B                       2020/07/07 V0.1 コンテナ在庫一覧表（サマリ）(EXCEL)     V0.0  =>V0.1
'                          ZAIK_SUMM テーブル項目追加
'                          コンテナ在庫一覧.xlsx
'                          コンテナ在庫一覧（サマリ）.xlsx
'
'        UPDATE          : 2020/07/14
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2020/06/29 V16.0 受付入力                               V15.8 =>V15.9
'                          MSZZ039                       2020/06/29 V6.7  共通関数 統合ヘルパー出力              V6.6  =>V6.7
'
'        UPDATE          : 2020/07/17
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2020/07/16 V16.1 受付入力                               V16.0 =>V16.1
'
'        UPDATE          : 2020/07/22
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          LS0060A                       2020/07/22 V0.7 コンテナ在庫一覧表(データ更新)          V0.6  =>V0.7
'
'        UPDATE          : 2020/07/29
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          RKS240　                      2020/07/29 V2.8 請求書                                  V2.4  =>V2.8
'
'        UPDATE          : 2020/07/29
'        UPDATER         : Y.WADA
'        Rev             : 0.1
'                          MSZZ039                       2020/07/21 V6.9 共通関数 統合ヘルパー出力               V6.8=>V6.9
'
'        UPDATE          : 2020/08/19
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          RKS240　                      2020/08/19 V2.8 請求書                                  V2.4  =>V2.8
'
'        UPDATE          : 2020/08/29
'        UPDATER         : Y.WADA
'        Rev             : 0.0
'                          FVS400                       2020/07/21 V16.2                                        V16.1=>V16.2
'                          FVS500                       2020/08/27 V5.6 予約入力                                V5.5=>V5.6
'                          Print530                     2020/07/27 V0.7 ご紹介連絡表出力処理                    V0.6=>V0.7
'                          CTRL_TABL
'
'                          MSZZ039                      2020/08/28 V7.0 共通関数 統合ヘルパー出力               V6.9=>V7.0
'
'                          FKS440_ヤードマスタ保守      2020/08/28 V5.8 ヤードマスタメンテ                      V5.7=>V5.8
'
'        UPDATE          : 2020/09/01
'        UPDATER         : Y.WADA
'        Rev             : 0.0
'                          MSHS012                      2020/09/01 V0.5 テーブルリンク(KOMS)                    V0.4=>V0.5
'
'        UPDATE          : 2020/09/24
'        UPDATER         : Y.WADA
'        Rev             : 0.0
'                          dbo_CTRL_TABL               テーブルリンク追加
'
'        UPDATE          : 2020/09/30
'        UPDATER         : Y.WADA
'        Rev             : 0.0
'                          FVS400                       2020/09/28 V16.3 受付入力                               V16.2=>V16.3
'                          CmKomsMod                    2020/09/30 V2.9                                         V2.8=>V2.9
'                          FVS500                       2020/09/30 V5.7 予約入力                                V5.6=>V5.7
'
'        UPDATE          : 2020/10/19
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS901                       2020/10/19 V0.7 ヤード修繕一覧画面                      V0.6=>V0.7
'
'        UPDATE          : 2020/10/20
'        UPDATER         : Y.WADA
'        Rev             : 0.0
'                          FVS400                       2020/10/15 V16.4 受付入力                               V16.3=>V16.4
'                          MSZZ039                      2020/10/15 V7.1                                         V7.0=>V7.1
'
'        UPDATE          : 2020/11/16
'        UPDATER         : Y.WADA
'        Rev             : 0.0
'                          FVS400                       2020/11/16 V16.6                                        V16.5=>V16.6
'                          MSZZ039                      2020/11/13 V7.2 共通関数 統合ヘルパー出力               V7.1=>V7.2
'
'        UPDATE          : 2020/11/20
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          FKS440_ヤードマスタ保守      2020/09/04 V5.9 ヤードマスタメンテ                      V5.8=>V5.9
'                          MSTGP01                      2020/11/20 V4.0 統合ＤＢ  コンテナ統合ＤＢ更新          V3.9=>V4.0
'
'        UPDATE          : 2020/11/30
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          MSTGP01                      2020/11/30 V4.1 統合ＤＢ  コンテナ統合ＤＢ更新          V4.0=>V4.1
'
'        UPDATE          : 2020/12/14
'        UPDATER         : Y.WADA
'        Rev             : 0.0
'                          FVS400                       2020/12/01 V16.7 受付入力
'                          LQ0050_M00                   2020/11/30 V2.5 契約データ（顧客住所無し&ヤード住所無し）
'                          LQ0050_M10                   2020/11/30 V2.4 契約データ（顧客住所有り&ヤード住所無し）
'                          LQ0050_M20                   2020/11/30 V2.2 契約データ（顧客住所無し&ヤード住所有り）
'                          LQ0050_M30                   2020/11/30 V2.2 契約データ（顧客住所有り&ヤード住所有り）
'
'        UPDATE          : 2020/12/15
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          FVS400                       2020/12/15 V16.8 受付入力                               V16.7=>V16.8
'
'        UPDATE          : 2020/12/17
'        UPDATER         : Y.WADA
'        Rev             : 0.0
'                          FVS600                       2020/12/15 V4.7 契約入力
'                          FVS601                       2020/12/15 V4.7 契約入力
'
'        UPDATE          : 2021/03/31
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2021/03/31 V16.9 受付入力                               V16.8=>V16.9
'                          CmKomsMod                    2021/03/31 V3.0                                         V2.9=>V3.0
'
'        UPDATE          : 2021/04/28
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS500                       2021/04/28 V5.8 予約入力                                V5.7=>V5.8
'
'        UPDATE          : 2021/05/10
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2021/05/10 V17.0 受付入力                               V16.9=>V17.0
'
'        UPDATE          : 2021/05/12
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS440_ヤードマスタサブ上    2021/05/12 V2.6  ヤードマスタメンテ（サブ）上段         V2.5=>V2.6
'
'        UPDATE          : 2021/05/28
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          LF0060                       2021/05/20 V0.5 コンテナ在庫一覧表                      V0.4=>V0.5
'
'        UPDATE          : 2021/07/08
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS020_コンテナ予約入力      2021/07/08 V2.8 利用状況                                V2.7=>V2.8
'
'        UPDATE          : 2021/08/03
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS440_ヤードマスタ保守      2021/06/02 V6.0  ヤードマスタメンテ                     V5.9=>V6.0
'                          FKS440_ヤードマスタサブ上    2021/06/02 V2.8  ヤードマスタメンテ（サブ）上段         V2.7=>V2.8
'                          FKS440_ヤードマスタサブ下    2021/06/02 V2.7  ヤードマスタメンテ（サブ）下段         V2.6=>V2.7
'                          ヤード上ＷＫ                 2021/06/02 V2.4  ヤードマスタメンテ（サブ）上段         V2.3=>V2.4
'                          ヤード下ＷＫ                 2021/06/02 V2.4  ヤードマスタメンテ（サブ）下段         V2.3=>V2.4
'                          FVS400                       2021/06/02 V17.1 受付入力                               V17.0=>V17.1
'                          FVS600                       2021/06/02 V4.8  契約入力                               V4.7=>V4.8
'                          FVS601                       2021/06/02 V4.8  契約入力                               V4.7=>V4.8
'                          FVS700                       2021/06/02 V2.0  解約入力                               V1.9=>V2.0
'                          FVS701                       2021/06/02 V2.0  解約入力                               V1.9=>V2.0
'                          FVS760                       2021/06/02 V1.5  解約メンテナンス表                     V1.4=>V1.5
'                          FVS760_Q01                   2021/06/02 V0.4  メンテナンス表                         V0.3=>V0.4
'                          MSZZ070                      2021/06/02 V0.3  共通関数 自動鍵解錠番号発番            V0.2=>V0.3
'                          MSZZ039                      2021/06/02 V7.3  共通関数 統合ヘルパー出力              V7.2=>V7.3
'                          FVS910                       2021/08/03 V1.4  修繕入力ダイアログ                     V1.3=>V1.4
'                          CmReprMod                    2021/08/03 V0.5 CmReprMod                               V0.4=>V0.5
'
'        UPDATE          : 2021/08/05
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2021/08/04 V17.2 受付入力                               V17.1=>V17.2
'
'        UPDATE          : 2021/08/05
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2021/8/06 V7.4  共通関数 統合ヘルパー出力               V7.3=>V7.4
'
'        UPDATE          : 2021/08/18
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2021/08/18 V17.3 受付入力                               V17.2=>V17.3
'
'        UPDATE          : 2021/08/20
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS600                       2021/08/20 V4.9  契約入力                               V4.8=>V4.9
'                          FVS601                       2021/08/20 V4.9  契約入力                               V4.8=>V4.9
'
'        UPDATE          : 2021/09/07
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ072                      2021/09/07 V0.1  共通関数　イメージコントロール制御     V0.0=>V0.1
'
'        UPDATE          : 2021/11/30
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS400                       2021/11/30 17.4 受付入力
'
'        UPDATE          : 2021/12/01
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2021/12/01 17.5 受付入力
'
'        UPDATE          : 2022/01/07
'        UPDATER         : n.imai
'        Rev             : 0.0
'                          MSTGP01                      2022/01/07 V4.5 統合ＤＢ  コンテナ統合ＤＢ更新          V4.1=>V4.5
'
'        UPDATE          : 2022/02/10
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS520                       2022/02/10 V0.5 予約受付検索                            V0.4=>V0.5
'
'        UPDATE          : 2022/02/15
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2022/02/14 17.6 受付入力                                V17.5=>V17.6
'                          FVS500                       2022/02/14 V5.9 予約入力                                V5.8=>V5.9
'                          FVS600                       2022/02/15 V5.0  契約入力                               V4.9=>V5.0
'
'        UPDATE          : 2022/04/28
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS700                       2022/04/28 V2.1  解約入力                               V2.0=>V2.1
'                          FVS701                       2022/04/28 V2.1  解約入力                               V2.0=>V2.1
'
'        UPDATE          : 2022/05/06
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS720　                     2022/05/06 V0.5 ヤード別割引一覧                        V0.4=>V0.5
'
'        UPDATE          : 2022/05/16
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2022/05/16 V7.5  共通関数 統合ヘルパー出力              V7.4=>V7.5
'
'        UPDATE          : 2022/05/17
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2022/05/17 V7.6  共通関数 統合ヘルパー出力              V7.5=>V7.6
'
'        UPDATE          : 2022/08/03
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS240                       2022/08/03 V3.1 請求表                                  V3.0=>V3.1
'
'        UPDATE          : 2022/08/15
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          WebSeikyu                    2022/08/03 V0.2 Web請求関数群                           V0.1=>V0.2
'                          RKS240　                     2022/08/15 V3.4 請求書                                  V3.3=>V3.4
'
'        UPDATE          : 2022/08/22
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2022/08/22 17.7 受付入力                                V17.6=>V17.7
'                          FVS540                       2022/08/22 V1.6 予約一覧                                V1.5 =>V1.6
'                          FVS540_S01                   2022/08/22 V1.6 予約一覧サブ（一覧）                    V1.3 =>V1.6
'                          FVS540_S02                   2022/08/22 V1.6 予約一覧サブ（検索条件）                V1.4 =>V1.6
'
'        UPDATE          : 2022/09/05
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2022/09/05 V7.7  共通関数 統合ヘルパー出力              V7.6=>V7.7
'                          WebSeikyu                    2022/09/05 V0.3 Web請求関数群                           V0.2=>V0.3
'
'        UPDATE          : 2022/10/11
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          LF0060                      2022/09/30 V0.6 コンテナ在庫一覧表                       V0.5=>V0.6
'                          LS0060                      2022/09/30 V0.3 コンテナ在庫一覧表(EXCEL)                V0.2=>V0.3
'                          LS0060A                     2022/09/30 V0.8 コンテナ在庫一覧表(データ更新)           V0.7=>V0.8
'                          LS0060B                     2022/09/30 V0.2 コンテナ在庫一覧表（サマリ）(EXCEL)      V0.1=>V0.2
'                          コンテナ在庫一覧(サマリ).xlsx
'
'        UPDATE          : 2022/10/12
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2022/10/12 V7.8  共通関数 統合ヘルパー出力              V7.7=>V7.8
'
'        UPDATE          : 2019/07/08
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS490                       2022/09/27 V1.2 ヤードマスタ一覧表                      V1.1=>V1.2
'
'        UPDATE          : 2022/11/01
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS720　                     2022/11/01 V0.6 ヤード別割引一覧                        V0.5=>V0.6
'
'        UPDATE          : 2022/11/10
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          Print910                     2022/11/10 V0.9 部屋修理依頼書出力                      V0.8=>V0.9
'
'        UPDATE          : 2022/11/28
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2022/11/28 V7.9  共通関数 統合ヘルパー出力              V7.8=>V7.9
'
'        UPDATE          : 2022/12/01
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          MSZZ039                      2022/11/28 V8.0  共通関数 統合ヘルパー出力              V7.9=>V8.0
'
'        UPDATE          : 2023/01/19
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS520                       2023/01/19 V0.6  予約受付検索 V0.6                      V0.5=>V0.6
'
'        UPDATE          : 2023/01/23
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS530                       2022/12/13 V0.8 ご紹介連絡表                            V0.7=>V0.8
'                          MSZZ066                      2022/12/26 V0.3  WebServer MySQL 関数（SSH2.0対応）     V0.2=>V0.3
'
'        UPDATE          : 2023/02/24
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS240                       2023/02/24 V3.4 請求表                                  V3.3=>V3.4
'
'        UPDATE          : 2022/02/27
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS910                       2022/02/27 V1.7  修繕入力ダイアログ                     V1.6=>V1.7
'                          CmReprMod                    2022/02/27 V0.6 CmReprMod                               V0.5=>V0.6
'                          LQ0050_M30                   2022/02/27 V2.3 契約データ(顧客住所有り&ヤード住所有り) V2.2=>V2.3
'
'        UPDATE          : 2023/02/28
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          WebSeikyu                    2023/02/28 V0.4 Web請求関数群                           V0.3=>V0.4
'
'        UPDATE          : 2022/03/02
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          CmKomsMod                    2022/03/02 V3.1                                         V3.0=>V3.1
'
'        UPDATE          : 2023/03/03
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS710　                     2023/03/03 V0.9 割引マスタメンテナンス                  V0.8=>0.9
'
'        UPDATE          : 2023/03/20
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2023/03/20 17.9 受付入力                                V17.8=>V17.9
'
'        UPDATE          : 2023/03/27
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2023/03/27 18.0 受付入力                                V17.9=>V18.0
'
'        UPDATE          : 2023/03/31
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          WebSeikyu                    2023/03/31 V0.5 Web請求関数群                           V0.4=>V0.5
'
'        UPDATE          : 2023/04/06
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS770                       2023/04/06 V1.0 精算依頼リスト                          V0.9=>V1.0
'
'        UPDATE          : 2022/04/18
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS910                       2022/04/18 V1.8  修繕入力ダイアログ                     V1.7=>V1.8
'
'        UPDATE          : 2023/04/21
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2023/04/21 17.9 受付入力                                V18.0=>V18.1
'                          MSZZ039                      2023/04/21 V8.0  共通関数 統合ヘルパー出力              V7.9=>V8.0
'
'        UPDATE          : 2023/05/08
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS600                       2023/05/08  V6.0 契約入力                               V5.9=>V6.0
'
'        UPDATE          : 2023/05/31
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          Print530                     2023/05/23 V0.8 ご紹介連絡表出力処理                    V0.7=>V0.8
'
'        UPDATE          : 2023/06/26
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS600                       2023/06/26 V5.1 契約入力                                V5.0=>V5.1
'
'        UPDATE          : 2023/06/29
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2023/09/29 V8.1  共通関数 統合ヘルパー出力              V8.0=>V8.1
'
'        UPDATE          : 2023/07/05
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          WebSeikyu                    2023/07/05 V0.6 Web請求関数群                           V0.5=>V0.6
'
'        UPDATE          : 2023/07/13
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS600                       2023/07/13 V0.6 セキュリティーカードマスタメンテ
'                          FVS760                       2023/07/13 V1.9 解約メンテナンス表
'
'
'        UPDATE          : 2023/08/08
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS000                       2023/08/03 V6.2 メインメニュー
'
'        UPDATE          : 2023/08/10
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS760                      解約メンテナンス表 V2.0
'
'        UPDATE          : 2023/08/14
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FKS020                       利用状況 V2.9
'
'        UPDATE          : 2023/09/06
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2023/09/06 18.4 受付入力                                V18.3=>V18.4
'
'        UPDATE          : 2023/09/07
'        UPDATER         : T.FURUKAWA
'        Rev             : 0.0
'                          RKS600                    　 2023/09/07 V0.3 セキュリティーカード依頼書
'                          RVS920　                     2023/09/07 V0.5 部屋修理依頼書
'
'        UPDATE          : 2023/09/11
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2023/09/11 18.5 受付入力                                V18.4=>V18.5
'
'        UPDATE          : 2023/09/11
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS440                       2023/09/13 V6.2 ヤードマスタメンテ
'
'        UPDATE          : 2023/09/21
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2023/09/21 18.6 受付入力                                V18.5=>V18.6
'
'        UPDATE          : 2023/09/26
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2023/09/26 18.7 受付入力                                V18.6=>V18.7
'
'        UPDATE          : 2023/09/26
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2023/09/26 18.8 受付入力                                V18.7=>V18.8
'
'        UPDATE          : 2023/10/03
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2023/10/03 V8.2  共通関数 統合ヘルパー出力              V8.1=>V8.2
'
'        UPDATE          : 2023/10/04
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2023/10/04 18.9 受付入力                                V18.8=>V18.9
'
'        UPDATE          : 2023/10/12
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2023/10/12 V8.3  共通関数 統合ヘルパー出力              V8.2=>V8.3
'
'        UPDATE          : 2023/10/16
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2023/10/16 V8.4  共通関数 統合ヘルパー出力              V8.3=>V8.4
'
'        UPDATE          : 2023/10/23
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2023/10/23 V8.5  共通関数 統合ヘルパー出力              V8.4=>V8.5
'
'        UPDATE          : 2023/10/26
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2023/10/26 19.0 受付入力                                V18.9=>V19.0
'
'        UPDATE          : 2023/10/31
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS240                       2023/10/31 V3.5 請求表                                  V3.4=>V3.5
'                          WebSeikyu                    2023/10/31 V0.7 Web請求関数群                           V0.6=>V0.7
'
'        UPDATE          : 2023/11/01
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          LF0050                       2023/11/01 V3.9 契約データ出力                          V3.8=>V3.9
'                          LQ0050_M30                   2023/11/01 V2.3 契約データ(顧客住所有り&ヤード住所有り) V2.3=>V2.5
'                          LQ0050_M10                   2023/11/01 V2.4 契約データ(顧客住所有り&ヤード住所無し) V2.4=>V2.5
'
'        UPDATE          : 2023/11/09
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2023/11/09 19.1 受付入力                                V19.0=>V19.1
'
'        UPDATE          : 2022/11/15
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          RKS240　                     2023/1115 V3.6 請求書                                   V3.5=>V3.6
'
'        UPDATE          : 2023/12/01
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          LF0050                       2023/12/01 V4.0 契約データ出力                          V3.9=>V4.0
'
'        UPDATE          : 2023/12/04
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS600                       2023/12/04 V0.7 セキュリティーカードマスタメンテ        V0.6=>V0.7
'                          FVS400                       2023/12/04 19.2 受付入力                                V19.1=>V19.2
'                          MSZZ039                      2023/12/04 V8.6  共通関数 統合ヘルパー出力              V8.5=>V8.6
'
'        UPDATE          : 2023/12/08
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS700                       2023/12/08 V0.8                                         V0.7=>V0.8
'                          FKS700_S01                   2023/12/08 V0.8 割引マスタ一覧(サブ)                    V0.6=>V0.8
'                          FKS800                       2023/12/08 V0.7 ボックスマスタメンテナンス              V0.6=>V0.7
'                          FKS800_S01                   2023/12/08 V0.7 ボックスマスタメンテナンス（サブ）      V0.2=>V0.7
'
'        UPDATE          : 2024/01/26
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS600                       2024/01/26 V5.2 契約入力                                V5.1=>V5.2
'
'        UPDATE          : 2024/02/15
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS720　                     2024/02/14 V0.6 ヤード別割引一覧                        V0.6=>V0.7
'
'        UPDATE          : 2024/02/19
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                       2024/02/19 19.3 受付入力                                V19.2=>V19.3
'
'        UPDATE          : 2024/04/26
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS760                       2024/04/26 V2.1 解約メンテナンス表 V2.0                 V2.0=>V2.1
'
'        UPDATE          : 2024/08/27
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS500                       2024/08/27 V6.0 予約入力                                V5.9=>V6.0
'
'        UPDATE          : 2024/10/23
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS490                       2024/10/23 V1.3 ヤードマスタ一覧表                      V1.2=>V1.3
'
'        UPDATE          : 2024/11/27
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ045                      2024/11/27 V1.6 共通関数 自動割引                       V1.5=>V1.6
'
'        UPDATE          : 2024/12/20
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS770                       2024/12/20 V1.1 精算依頼リスト                          V1.0=>V1.1
'
'        UPDATE          : 2025/01/16
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          RVS760　                     2025/10/16 V1.8 解約メンテナンス表                      V1.7=>V1.8
'
'        UPDATE          : 2025/01/27
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS011                       2025/01/27 V1.3 空状況一覧                              V1.2=>V1.3
'
'        UPDATE          : 2025/05/23
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          LF0050                       2025/05/22 V4.1 契約データ出力                          V4.0=>V4.1
'
'        UPDATE          : 2025/07/11
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS020                       2025/07/11 V3.0 利用状況                                V2.9=>V3.0
'
'        UPDATE          : 2025/07/16
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          Print910                     2025/07/16 V1.0 部屋修理依頼書出力                      V0.9=>V1.0
'
'        UPDATE          : 2025/07/18
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          LF0050                       2025/07/18 V4.2 契約データ出力                          V4.1=>V4.2
'
'        UPDATE          : 2025/08/05
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          LF0050                       2025/08/05 V4.3 契約データ出力                          V4.2=>V4.3
'
'        UPDATE          : 2025/09/05
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          MSZZ039                      2025/09/05 V8.7  共通関数 統合ヘルパー出力              V8.6=>V8.7
'
'        UPDATE          : 2025/09/12
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          CmReprMod                    2025/09/12 V0.7 CmReprMod                               V0.6=>V0.7
'
'        UPDATE          : 2025/11/21
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          FKS490                       2025/11/21 V1.4 ヤードマスタ一覧表                      V1.3=>V1.4
'                          FVS700                       2025/11/20 V2.3 解約入力                                V2.2=>V2.3
'                          FVS701                       2025/11/20 V2.2 解約入力                                V2.1=>V2.2
'
'        UPDATE          : 2025/12/11
'        UPDATER         : T.KAWABATA
'        Rev             : 0.0
'                          FKS440_ヤードマスタ保守      2025/11/20 V6.3 ヤードマスタメンテ                      V6.2=>V6.3
'                          FVS500_予約入力              2025/12/04 V6.1 予約入力                                V6.0=>V6.1
'                          Print530_ご紹介連絡表出力処理 2025/12/04 V0.9 ご紹介連絡表出力処理                   V0.8=>V0.9
'
'        UPDATE          : 2025/12/15
'        UPDATER         : T.KAWABATA
'        Rev             : 0.0
'                          Print530_ご紹介連絡表出力処理 2025/12/15 V1.0 ご紹介連絡表出力処理                   V0.9=>V1.0
'
'        UPDATE          : 2026/01/22
'        UPDATER         : M.HONDA
'        Rev             : 0.0
'                          FVS760                        2026/01/22 FVS760 解約メンテナンス表                   V2.1 =>V2.2
'                          RVS760                        2026/01/22 RVS760 解約メンテナンス表                   V1.8 =>V1.9
'                          FKS000                        2026/01/23 V6.3 メインメニュー                         V6.2 =>V6.3
'                          FKS020                        2026/01/23 V3.1 利用状況                               V3.0 =>V3.1
'
'        UPDATE          : 2026/03/10
'        UPDATER         : K.KINEBUCHI
'        Rev             : 0.0
'                          MSZZ039                       2026/03/10 V8.9 共通関数 統合ヘルパー出力              V8.8 =>V8.9
'
'        UPDATE          : 2026/04/02
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2026/03/30 19.4 受付入力                               V19.3=>V19.4
'
'        UPDATE          : 2026/04/06
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FVS400                        2026/04/06 19.5 受付入力                               V19.4=>V19.5
'                          FKS600                        2026/04/06 V0.8 セキュリティーカードマスタメンテ       V0.7=>V0.8
'
'        UPDATE          : 2026/04/16
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          LF0052                        2026/04/14 V1.4 宛名印刷 koms専用                      V1.3=>V1.4
'                          LR0052_M00                    2026/04/14 V1.4 宛名印刷(小封筒) koms専用              V0.2=>V1.4
'                          LR0052_M10                    2026/04/14 V1.4 宛名印刷(中封筒) koms専用              V0.2=>V1.4
'
'        UPDATE          : 2026/04/20
'        UPDATER         : T.KAWABATA
'        Rev             : 0.0
'                          Print910                      2026/04/20 V1.1 メンテナンス依頼書出力                 V3.1 =>V3.2
'
'        UPDATE          : 2026/04/21
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          FKS020                        2026/04/20 V3.2 利用状況                               V3.1 =>V3.2
'
'        UPDATE          : 2026/04/22
'        UPDATER         : N.IMAI
'        Rev             : 0.0
'                          LF0052                        2026/04/14 V1.4 宛名印刷 koms専用                      V1.3=>V1.4
'                          FVS400                        2026/04/22 19.6 受付入力                               V19.5=>V19.6
'                          FKS020_コンテナ予約入力サブ   2026/04/22 V1.1 利用状況オーナー                       V1.0=>V1.1
'
'==============================================================================*
Option Compare Database
'****************************  ended of program ********************************
